[
  {
    "path": "1Xyo4u8uXC1ZmMpatF05PJ",
    "id": 1,
    "name": "The Weeknd",
    "verified": true,
    "followed": true,
    "color": "28, 44, 119",
    "artistimage": "/theweeknd.jpg",
    "artistbackimage": "/theweeknd_back.jpg",
    "monthlylisteners": 120955761,
    "populartracks": [
      "0FIDCNYYjNvPVimz5icugS",
      "0VjIjW4GlUZAMYd2vXMi3b",
      "7MXVkk9YMctZqd1Srtv4MB",
      "5QO79kh1waicV47BqGRL3g",
      "7DY756WOLyOz2Xnhw4EFiC",
      "2Ch7LmS7r2Gy2kc64wv3Bz"
    ],
    "artistpick": {
      "path": "3OxfaVgvTxUTy7276t7SPU",
      "coverpath": "/hurryuptomorrow.jpg",
      "albumname": "Hurry Up Tomorrow"
    },
    "discography": {
      "all": [
        "3OxfaVgvTxUTy7276t7SPU",
        "44MHvpU3h9Wp6SxhsC9GOK",
        "2IRxVVqbSbqHJo8Zx50LYn",
        "0MwPArEeQJx5GMc5Sz7kRV",
        "18sR8zHx4zsVJUI4bHWuPC",
        "4T8wBxIvoSRVfoFZzuwOXR",
        "3P2UkOkqWp8ucd1EOnVAH7",
        "35dut3ICqF3NEDkjxfzJJ1",
        "1OARrXe5sB0gyy3MhQ8h92",
        "12INlMsFtBjyehNnawBv36",
        "6fgSKdHloRioPrZ9oJC7FH",
        "3GPiefSRSOxqTrgKJIB7RL",
        "4yP0hdKOZPNshxUOjY0cZj",
        "4qZBW3f2Q8y0k1A84d4iAO",
        "0NSognr1k6PH6SZZ6uv44G",
        "2ODvWsOgouMbaA5xf0RkJe",
        "0P3oVJBFOv3TDXlYRhGL7s",
        "42j6ji8hAqwHUpvw2H08SU"
      ],
      "popular": [
        "3OxfaVgvTxUTy7276t7SPU",
        "4yP0hdKOZPNshxUOjY0cZj",
        "2ODvWsOgouMbaA5xf0RkJe",
        "0P3oVJBFOv3TDXlYRhGL7s",
        "2IRxVVqbSbqHJo8Zx50LYn",
        "4qZBW3f2Q8y0k1A84d4iAO",
        "12INlMsFtBjyehNnawBv36",
        "44MHvpU3h9Wp6SxhsC9GOK"
      ]
    },
    "about": {
      "rankintheworld": 2,
      "followers": 99367314,
      "mostlistenedplaces": [
        {
          "place": "Jakarta, ID",
          "listenersnumber": 2450814
        },
        {
          "place": "Mexico City, MX",
          "listenersnumber": 1503713
        },
        {
          "place": "São Paulo, BR",
          "listenersnumber": 1497354
        },
        {
          "place": "London, GB",
          "listenersnumber": 1376129
        },
        {
          "place": "Sydney, AU",
          "listenersnumber": 1234125
        }
      ],
      "socialmediaweb": [
        {
          "Facebook": "https://www.facebook.com/theweeknd/",
          "Instagram": "https://www.instagram.com/theweeknd/",
          "Twitter": "https://x.com/theweeknd",
          "Wikipedia": "https://uz.wikipedia.org/wiki/The_Weeknd"
        }
      ],
      "briefinfo": "The Weeknd took over pop music & culture on his own terms filtering R&B, Pop,& hip-hop through an ambitious widescreen lens. The multi-platinum 3X GRAMMY Award winner has emerged as one of the most successful & significant artists of the modern era. 2012’s 3X platinum Trilogy collated 3 breakout mixtapes—House of Balloons, Thursday & Echoes of Silence—into his 1st chart-topping collection followed by his debut LP Kiss Land in 2013. Two years later, “Earned It (Fifty Shades of Grey)” won “Best R&B Performance” & received an Academy Award nod for “Best Original Song” & 4X Platinum Beauty Behind The Madness won a GRAMMY for “Best Urban Contemporary Album.” In 2018,Starboy  won the same award, making him the 1st artist ever to win twice. His 6-track project My Dear Melancholy marked his 3rd consecutive #1 bow on the Billboard Top 200, & “Pray For Me” with Kendrick Lamar & Niels was featured in the trailer for the Academy Award winning Marvel film Black Panther. In 2020 the 80’s-nostalgic track Blinding Lights became a worldwide sensation, igniting viral dance challenges across social media, peaking at #1 in 30+ countries & headlining Mercedes Benz EQC campaign. After Hours held the #1 spot on Billboard 200 for 4 consecutive weeks, marking his 4th #1 album & becoming the first to ever rank #1 on the Billboard 200, Hot 100, and Artist 100 simultaneously. After Hours is the #1 R&B streaming album of all time (followed by Starboy at #2)."
    }
  },
  {
    "path": "6M2wZ9GZgrQXHCFfjv46we",
    "id": 2,
    "name": "Dua Lipa",
    "verified": true,
    "followed": true,
    "color": "0, 57, 74",
    "artistimage": "/dualipa.jpg",
    "artistbackimage": "/dualipa_back.jpg",
    "monthlylisteners": 64898719,
    "populartracks": [
      "5q0EXnBYyeCdXD72FzJxH0",
      "6D8y7Bck8h11byRY88Pt2z",
      "5b5cPscqVEMChvDqscVw26",
      "1AVtceapuF36oZqI9gzp0o",
      "1imMjt1YGNebtrtTAprKV7",
      "76cy1WJvNGJTj78UqeA5zr"
    ],
    "artistpick": {
      "path": "1Mo92916G2mmG7ajpmSVrc",
      "coverpath": "/radicaloptimism.jpg",
      "albumname": "Radical Optimism"
    },
    "discography": {
      "all": [
        "1Mo92916G2mmG7ajpmSVrc",
        "5cH7FqB7JD5q1tJXJ7FHYu",
        "5lKlFlReHOLShQKyRv6AL9",
        "01sfgrNbnnPUEyz6GZYlt9"
      ],
      "popular": [
        "1Mo92916G2mmG7ajpmSVrc",
        "5lKlFlReHOLShQKyRv6AL9",
        "01sfgrNbnnPUEyz6GZYlt9",
        "5cH7FqB7JD5q1tJXJ7FHYu"
      ]
    },
    "about": {
      "rankintheworld": 23,
      "followers": 45521348,
      "mostlistenedplaces": [
        {
          "place": "Mexico City, MX",
          "listenersnumber": 1029527
        },
        {
          "place": "Santiago, CL",
          "listenersnumber": 962392
        },
        {
          "place": "Sydney, AU",
          "listenersnumber": 828570
        },
        {
          "place": "Jakarta, ID",
          "listenersnumber": 802994
        },
        {
          "place": "São Paulo, BR",
          "listenersnumber": 792702
        }
      ],
      "socialmediaweb": [
        {
          "Facebook": "https://www.facebook.com/DuaLipa/",
          "Instagram": "https://www.instagram.com/DuaLipa/",
          "Twitter": "https://x.com/DuaLipa",
          "Wikipedia": "https://uz.wikipedia.org/wiki/Dua_Lipa"
        }
      ],
      "briefinfo": "Inspired by Dua’s own self-discovery, Radical Optimism (out May 3) is the third album from 3x GRAMMY and 7x BRIT Award-winning pop powerhouse Dua Lipa. Radical Optimism taps into the pure joy and happiness of having clarity in situations that once seemed impossible to face. The hard goodbyes and vulnerable beginnings that previously threatened to crush your soul, become milestones as you choose optimism and start to move with grace through the chaos. Rolling Stone has called the album “pop bliss,” while noting it is “uniquely and utterly Dua Lipa: confident dance pop full of witty Instagram-caption-ready one-liners.”\n\nRadical Optimism follows Dua' sophomore album Future Nostalgia, which solidified her position as both a critical and commercial success. The GRAMMY-winning record was the longest running top 10 album by a female artist on the Billboard 200 in 2021 and spawned multiple worldwide hit singles, with “Levitating” earning certified diamond status and the title of Billboard’s No. 1 Hot 100 Song of 2021.\n\nDua’s eponymous 2017 debut album is certified platinum, spawned six platinum tracks, and made her the first female artist in BRIT Awards history to pick up five nominations in a single year. Dua has 10 GRAMMY nominations with three wins. Globally, she has amassed over 40 billion streams across platforms and has the top two most streamed albums by a female artist of all time on Spotify."
    }
  },
  {
    "path": "66CXWjxzNUsdJxJ2JdwvnR",
    "id": 3,
    "name": "Ariana Grande",
    "verified": true,
    "followed": true,
    "color": "100, 0, 0",
    "artistimage": "/arianagrande.jpg",
    "artistbackimage": "/arianagrande_back.jpg",
    "monthlylisteners": 84532872,
    "populartracks": [
      "51ZQ1vr10ffzbwIjDCwqm4",
      "0Lmbke3KNVFXtoH2mMSHCw"
    ],
    "artistpick": {
      "path": "5EYKrEDnKhhcNxGedaRQeK",
      "coverpath": "/eternalsunshine.jpg",
      "albumname": "eternal sunshine"
    },
    "discography": {
      "all": [
        "5EYKrEDnKhhcNxGedaRQeK",
        "3euz4vS7ezKGnNSwgyvKcd",
        "42j6ji8hAqwHUpvw2H08SU"
      ],
      "popular": [
        "5EYKrEDnKhhcNxGedaRQeK",
        "3euz4vS7ezKGnNSwgyvKcd"
      ]
    },
    "about": {
      "rankintheworld": 11,
      "followers": 103543691,
      "mostlistenedplaces": [
        {
          "place": "Jakarta, ID",
          "listenersnumber": 2852975
        },
        {
          "place": "Quezon City, PH",
          "listenersnumber": 1061681
        },
        {
          "place": "London, GB",
          "listenersnumber": 1060344
        },
        {
          "place": "Sydney, AU",
          "listenersnumber": 920996
        },
        {
          "place": "São Paulo, BR",
          "listenersnumber": 914488
        }
      ],
      "socialmediaweb": [
        {
          "Facebook": "https://www.facebook.com/arianagrande/",
          "Instagram": "https://www.instagram.com/arianagrande/",
          "Wikipedia": "https://uz.wikipedia.org/wiki/Ariana_Grande"
        }
      ],
      "briefinfo": "With her four-octave vocal acrobatics and iconic image, American singer, songwriter, and actress Ariana Grande has solidified her place as one of the quintessential pop stars of her generation, racking up stacks of awards and chart records in the process. Emerging in the early 2010s with the hit single \"The Way,\" Grande was primed to follow in the footsteps of her biggest influences, Whitney Houston and Mariah Carey, due in part to her powerhouse vocals. With its Babyface production, her debut, Yours Truly, underscored her debt to '90s R&B, but Grande quickly incorporated hip-hop and EDM into her sound. \"Problem,\" a 2014 smash duet with Iggy Azalea, was the first indication of her development, an evolution reinforced by the hits \"Bang Bang\" and \"Love Me Harder.\" Grande maintained her popularity with 2016's Dangerous Woman, then really hit her stride with 2018's Sweetener and its swift sequel, Thank U, Next, whose title track sat atop the U.S. singles chart for seven weeks. That achievement was quickly equaled by the album's glitzy second single, \"7 Rings,\" and later with \"Positions,\" the lead single from 2020's R&B-heavy album of the same name. After four years without an album -- a relative eternity considering her turn-of-the-decade blitz -- Grande returned with Eternal Sunshine, which she recorded while shooting the film version of Broadway's Wicked.\n\nA native of Boca Raton, Florida, where she was born in 1993 to graphic designer Edward Butera and Joan Grande (the CEO of Hose-McCann Communications), Grande began singing and acting at an early age, appearing in local theater productions. In 2008, when she was 15, she landed the role of Charlotte in the Broadway production of 13; her performance was well-received, and she won a National Youth Theatre Association Award. Following an appearance in the 2010 Desmond Child-written musical Cuba Libre, Grande was cast as Cat Valentine in the Nickelodeon television program Victorious. The show ran until 2012, at which time Grande's Cat Valentine was spun off into a show called Sam & Cat, which also starred Jennette McCurdy of iCarly.\n\nAs she kept herself busy with television, Grande began to pursue a musical career. She frequently made appearances at sporting events and with symphonies, and she made her first appearances on record with the soundtrack to Victorious. In 2011, she released the single \"Put Your Hearts Up,\" which was cut during sessions for a teen-oriented pop album; she later disowned the single due to its kiddie feel. Grande felt much more comfortable with \"The Way,\" her 2013 single featuring Mac Miller. This signaled a mature direction and audiences responded, taking it to the Top Ten in the U.S., where it was eventually certified triple platinum. It was the first single from her 2013 debut, Yours Truly, which also featured hits in \"Baby I\" and \"Right There.\"\n\nAt the end of the year, she released a seasonal EP called Christmas Kisses, but her real efforts went into the recording of her second album, My Everything. Preceded by the single \"Problem\" -- a song that featured a guest spot from Iggy Azalea, the \"It girl\" of the summer of 2014; it peaked at two on the U.S. charts and was certified double platinum -- the album featured a host of different producers, including Max Martin, Shellback, Ryan Tedder, and Benny Blanco. It was released at the end of August 2014, hitting number one on charts across the globe. Subsequent singles featured assists by Zedd (\"Break Free\"), Jessy J & Nicki Minaj (\"Bang Bang\"), and the Weeknd (\"Love Me Harder\"). At one point in 2014, three of her songs were in the Billboard Top Ten at the same time, a feat matched only by Adele. By the time fifth single \"One Last Time\" charted in early 2015, My Everything had sold nearly 600,000 copies.\n\nAs that album's cycle wound down, Grande guest-starred on Ryan Murphy's campy slasher series Scream Queens and she also recorded another holiday EP, Christmas & Chill. In October 2015, Grande released the single \"Focus\", which debuted at number seven on the Hot 100 and was certified platinum the following January. That February, she announced her third album, Dangerous Woman, and released the album's title track as a single in March. The song hit number eight on the Hot 100, making Grande the first artist to have the lead single from each of her first three albums debut in the Top Ten. Featuring collaborations with Macy Gray, Future, and Nicki Minaj, the album appeared in May 2016 and debuted at number two. It eventually went platinum, helped by a trio of Top Ten hits and a Grammy nomination for Best Pop Vocal Album. Grande began 2017 by duetting with John Legend on \"Beauty and the Beast,\" the title track for Disney's live-action remake of the 1991 animated classic. She then mounted her Dangerous Woman Tour, performing across North America and Europe during the first half of 2017.\n\nTragedy struck on May 22, 2017, when a suicide bomber attacked Grande's concert at the Manchester Arena in Manchester, England. Grande returned to performing on June 4, when she held a star-studded charity concert called One Love Manchester to aid the victims of the bombing. Following the show, she resumed the Dangerous Woman Tour, which concluded in Hong Kong that September.\n\nIn April 2018, Grande kicked off promotion for her fourth album, Sweetener, by issuing the single \"No Tears Left to Cry,\" which debuted at number three on the Hot 100.\n\nThree months after the release of Sweetener, Grande returned with the non-LP single \"Thank U, Next.\" Quickly becoming an internet sensation, \"Thank U, Next\" shot to number one throughout the world, as did Grande's next single, \"7 Rings.\" Both songs were featured on the full-length album Thank U, Next, which appeared in February 2019. Her fourth U.S. number one, the set also topped the charts in over a dozen countries, further buoyed by third single \"Break Up with Your Girlfriend, I'm Bored.\" Mere months after the release of Thank U, Next, Grande moved on with a series of collaborations, including \"Monopoly\" with Victoria Monet, \"Boyfriend\" with Social House, and the Charlie's Angels reboot theme \"Don't Call Me Angel\" with Miley Cyrus and Lana Del Rey. Capping off the year, Grande was nominated for five Grammy Awards: Album of the Year and Best Pop Vocal Album for Thank U, Next, Record of the Year and Best Pop Solo Performance for \"7 Rings,\" and Best Pop Duo/Group Performance for \"Boyfriend.\" She capped this prolific period with k bye for now, a live album recorded at various stops throughout her 2019 Sweetener World Tour.\n\nGrande had duets reach the top of the Billboard charts in early 2020 -- first it was \"Stuck with U\" with Justin Bieber, then it was \"Rain on Me\" with Lady Gaga -- before she launched her next album, Positions, with the release of its title track. The single reached number one just before the October 30 release of the album, which became her fifth to top the Billboard 200. \"34+35\" kept her planted toward the upper reaches of the singles chart, boosted by a 2021 remix with Doja Cat and Megan Thee Stallion. That same year, she teamed up with the Weeknd on a remix of his song \"Save Your Tears,\" delivering another chart-topper for both artists. They repeated this same success two years later when Grande appeared on a remix of \"Die for You\" from the Weeknd's Starboy album. During this time, Grande had also pivoted back to acting, appearing in the 2021 ensemble satire Don't Look Up, for which she recorded \"Just Look Up\" with Kid Cudi. She was also cast as Glinda in the film adaptation of Wicked, which began filming in 2022. In 2023, Grande celebrated a decade since her debut with the Yours Truly (Tenth Anniversary Edition) reissue.\n\nThe following year, she kicked off her next album cycle with the chart-topping, '90s-club-inspired \"yes, and?\" and a remix version featuring Mariah Carey. The single paved the way for her seventh overall album, Eternal Sunshine, which arrived in March 2024. A conceptual journey through divorce and the sparks of new love, the set featured production by Max Martin and Ilya Salmanzadeh, and balanced upbeat empowerment with reflective vulnerability. The album, which also spawned the Hot 100 singles \"We Can't Be Friends (Wait for Your Love)\" and \"The Boy Is Mine,\" topped the Billboard 200. It also picked up three Grammy nominations, including Best Pop Vocal Album. ~ Stephen Thomas Erlewine, Rovi"
    }
  },
  {
    "path": "6qqNVTkY8uBg9cP3Jd7DAH",
    "id": 4,
    "name": "Billie Eilish",
    "verified": true,
    "followed": true,
    "color": "7, 32, 63",
    "artistimage": "/billieeilish.jpg",
    "artistbackimage": "/billieeilish_back.jpg",
    "monthlylisteners": 105954005,
    "populartracks": [
      "6dOtVTDdiauQNBQEDOtlAB",
      "3QaPy1KgI7nu9FJEQUgn6h",
      "6wf7Yu7cxBSPrRlWeSeK0Q",
      "7BRD7x5pt8Lqa1eGYC4dzj",
      "43zdsphuZLzwA9k4DJhU0I",
      "2Fxmhks0bxGSBdJ92vM42m"
    ],
    "artistpick": {
      "path": "7aJuG4TFXa2hmE4z1yxc3n",
      "coverpath": "/hitmehardandsoft.jpg",
      "albumname": "HIT ME HARD AND SOFT"
    },
    "discography": {
      "all": [
        "7aJuG4TFXa2hmE4z1yxc3n",
        "3AafSrFIbJPH6BJHiJm1Cd",
        "0S0KGZnfBGSIssfF54WSJh"
      ],
      "popular": [
        "7aJuG4TFXa2hmE4z1yxc3n",
        "3AafSrFIbJPH6BJHiJm1Cd",
        "0S0KGZnfBGSIssfF54WSJh"
      ]
    },
    "about": {
      "rankintheworld": 4,
      "followers": 107049866,
      "mostlistenedplaces": [
        {
          "place": "Jakarta, ID",
          "listenersnumber": 3050754
        },
        {
          "place": "London, GB",
          "listenersnumber": 1332197
        },
        {
          "place": "Sydney, AU",
          "listenersnumber": 1202824
        },
        {
          "place": "Mexico City, MX",
          "listenersnumber": 1069728
        },
        {
          "place": "São Paulo, BR",
          "listenersnumber": 1055996
        }
      ],
      "socialmediaweb": [
        {
          "Facebook": "https://www.facebook.com/billieeilish/",
          "Instagram": "https://www.instagram.com/billieeilish/",
          "Twitter": "https://www.x.com/billieeilish/",
          "Wikipedia": "https://uz.wikipedia.org/wiki/Billie_Eilish"
        }
      ],
      "briefinfo": "Billie Eilish remains one of the biggest stars to emerge in the 21st century. Her third studio album, HIT ME HARD AND SOFT features 10 tracks written and recorded in her hometown of Los Angeles, with her brother and producer FINNEAS. In 2019, her debut album WHEN WE ALL FALL ASLEEP, WHERE DO WE GO? debuted at No. 1 in 18 countries, and was the most streamed album of that year. In 2021, her sophomore album 'Happier Than Ever’ debuted at #1 in 20 countries. Both albums were critically acclaimed worldwide and were written, produced, and recorded entirely by Billie Eilish and FINNEAS. 9-time GRAMMY® Award-winning Billie Eilish has made history as the youngest artist to receive nominations and win in all the major GRAMMY® categories, receiving an award for Best New Artist, Album of the Year, Record of the Year, Song of the Year, and Best Pop Vocal Album, and is the youngest artist to write and record an official James Bond theme song, ‘No Time To Die,’ which won an Academy Award for Best Original Song in 2022. In 2023, Eilish also wrote and released the critically acclaimed song “What Was I Made For?” for the Greta Gerwig-directed motion picture Barbie, which also won Academy and Golden Globe Award for Best Original Song, two GRAMMY® Awards for Song of the Year and Best Song Written For Visual Media, and has solidified Billie Eilish yet again in the history books as the youngest person ever to win two Academy Awards."
    }
  },
  {
    "path": "5INjqkS1o8h1imAzPqGZBb",
    "id": 5,
    "name": "Tame Impala",
    "verified": true,
    "followed": true,
    "color": "53, 53, 53",
    "artistimage": "/tameimpala.jpg",
    "artistbackimage": "/tameimpala_back.jpg",
    "monthlylisteners": 26373751,
    "populartracks": [
      "6K4t31amVTZDgR3sKmwUJJ",
      "5hM5arv9KDbCHS0k9uqwjr",
      "2X485T9Z5Ly0xyaghN73ed",
      "52ojopYMUzeNcudsoz7O9D",
      "5M4yti0QxgqJieUYaEXcpw",
      "0mO6oS60RST2sWmN2FKknP"
    ],
    "artistpick": {
      "path": "79dL7FLiJFOO0EoehUHQBv",
      "coverpath": "/currents.jpg",
      "albumname": "Currents"
    },
    "discography": {
      "all": [
        "3PyQnHsgeniXrpuxJ4FmEv",
        "31qVWUdRrlb8thMvts0yYL",
        "79dL7FLiJFOO0EoehUHQBv"
      ],
      "popular": [
        "79dL7FLiJFOO0EoehUHQBv",
        "31qVWUdRrlb8thMvts0yYL",
        "3PyQnHsgeniXrpuxJ4FmEv"
      ]
    },
    "about": {
      "rankintheworld": 207,
      "followers": 8587006,
      "mostlistenedplaces": [
        {
          "place": "Sydney, AU",
          "listenersnumber": 405014
        },
        {
          "place": "London, GB",
          "listenersnumber": 395138
        },
        {
          "place": "Los Angeles, US",
          "listenersnumber": 382368
        },
        {
          "place": "Melbourne, AU",
          "listenersnumber": 353681
        },
        {
          "place": "Mexico City, MX",
          "listenersnumber": 341103
        }
      ],
      "socialmediaweb": [
        {
          "Facebook": "https://www.facebook.com/tameimpala/",
          "Instagram": "https://www.instagram.com/tameimpala/",
          "Twitter": "https://www.x.com/tameimpala/",
          "Wikipedia": "https://en.wikipedia.org/wiki/Tame_Impala"
        }
      ],
      "briefinfo": "Tame Impala (Kevin Parker) has officially released his fourth studio album, The Slow Rush. Featuring the tracks Lost In Yesterday, Borderline & It Might Be Time. The Slow Rush was recorded between Los Angeles and Parker’s studio in his hometown of Fremantle, Australia. The twelve tracks were written, recorded, produced and mixed by Parker. The Slow Rush is Parker’s deep dive into the oceans of time, conjuring the feeling of a lifetime in a lightning bolt, of major milestones whizzing by while you’re looking at your phone, it’s a paean to creation and destruction and the unending cycle of life. In support of The Slow Rush, Tame Impala will tour across North America, Australia & New Zealand, and the UK in the coming months. Thanks to the ravenous demand of fans for a transcendent live performance, Tame Impala has headlined festivals and theatres around the world and released three full length albums - Innerspeaker, Lonerism and Currents. As a writer and producer Parker has collaborated with Travis Scott, SZA, Lady Gaga, Mark Ronson, Kanye West, Kali Uchis, Theophilus London, Miguel, A$AP Rocky and more."
    }
  },
  {
    "path": "00FQb4jTyendYWaN8pK0wa",
    "id": 6,
    "name": "Lana Del Rey",
    "verified": true,
    "followed": true,
    "color": "45, 52, 68",
    "artistimage": "/lanadelrey.jpg",
    "artistbackimage": "/lanadelrey_back.jpg",
    "monthlylisteners": 61389217,
    "populartracks": [
      "3BJe4B8zGnqEdQPMvfVjuS",
      "5ZDKPFRZC6QlJpf8bCIXTs",
      "5Y6nVaayzitvsD5F7nr3DV",
      "1NZs6n6hl8UuMaX0UC0YTz",
      "0fBSs3fRoh1yJcne77fdu9",
      "2vtmY2mSccRzKGjtcHSzI3"
    ],
    "artistpick": {
      "path": "1ORxRsK3MrSLvh7VQTF01F",
      "coverpath": "/ultraviolencedeluxe.jpg",
      "albumname": "Ultraviolence (Deluxe)"
    },
    "discography": {
      "all": [
        "0NSognr1k6PH6SZZ6uv44G",
        "1ORxRsK3MrSLvh7VQTF01F",
        "5VoeRuTrGhTbKelUfwymwu"
      ],
      "popular": [
        "1ORxRsK3MrSLvh7VQTF01F",
        "5VoeRuTrGhTbKelUfwymwu"
      ]
    },
    "about": {
      "rankintheworld": 26,
      "followers": 44687754,
      "mostlistenedplaces": [
        {
          "place": "Jakarta, ID",
          "listenersnumber": 1330185
        },
        {
          "place": "London, GB",
          "listenersnumber": 772081
        },
        {
          "place": "São Paulo, BR",
          "listenersnumber": 647234
        },
        {
          "place": "Mexico City, MX",
          "listenersnumber": 629197
        },
        {
          "place": "Sydney, AU",
          "listenersnumber": 581897
        }
      ],
      "socialmediaweb": [
        {
          "Facebook": "https://www.facebook.com/lanadelrey/",
          "Instagram": "https://www.instagram.com/lanadelrey/",
          "Twitter": "https://www.x.com/lanadelrey/",
          "Wikipedia": "https://uz.wikipedia.org/wiki/Lana_Del_Rey"
        }
      ],
      "briefinfo": "."
    }
  },
  {
    "path": "0iEtIxbK0KxaSlF7G42ZOp",
    "id": 7,
    "name": "Metro Boomin",
    "verified": true,
    "followed": false,
    "color": "8, 55, 71",
    "artistimage": "/metroboomin.jpg",
    "artistbackimage": "/metroboomin_back.jpg",
    "monthlylisteners": 49674236,
    "populartracks": [
      "2tudvzsrR56uom6smgOcSf",
      "2Hh3ETdQKrmSI3QS0hme7g",
      "5wG3HvLhF6Y5KTGlK0IW3J",
      "2dHHgzDwk4BJdRwy9uXhTO",
      "0vjeOZ3Ft5jvAi9SBFJm1j",
      "1fewSx2d5KIZ04wsooEBOz"
    ],
    "artistpick": {
      "path": "7txGsnDSqVMoRl6RQ9XyZP",
      "coverpath": "/heroesvillains.jpg",
      "albumname": "Heroes & Villains"
    },
    "discography": {
      "all": [
        "3bSNhnaQQXpC639OQ4pMyP",
        "4iqbFIdGOTzXeDtt9owjQn",
        "3P2UkOkqWp8ucd1EOnVAH7",
        "7txGsnDSqVMoRl6RQ9XyZP",
        "3IO8IPjwXuzPJnoaqkwYrj"
      ],
      "popular": [
        "7txGsnDSqVMoRl6RQ9XyZP",
        "4iqbFIdGOTzXeDtt9owjQn",
        "3IO8IPjwXuzPJnoaqkwYrj",
        "3bSNhnaQQXpC639OQ4pMyP"
      ]
    },
    "about": {
      "rankintheworld": 53,
      "followers": 10423586,
      "mostlistenedplaces": [
        {
          "place": "Los Angeles, US",
          "listenersnumber": 691937
        },
        {
          "place": "Chicago, US",
          "listenersnumber": 668386
        },
        {
          "place": "London, GB",
          "listenersnumber": 648196
        },
        {
          "place": "New York City, US",
          "listenersnumber": 610025
        },
        {
          "place": "Dallas, US",
          "listenersnumber": 606030
        }
      ],
      "socialmediaweb": [
        {
          "Facebook": "https://www.facebook.com/MetroBoomin/",
          "Instagram": "https://www.instagram.com/metroboomin/",
          "Twitter": "https://www.x.com/MetroBoomin/",
          "Wikipedia": "https://en.wikipedia.org/wiki/Metro_Boomin"
        }
      ],
      "briefinfo": "St. Louis-raised, Atlanta-based producer Metro Boomin is the master of a street-oriented sound that is jet-black and low-gloss, sufficiently reflected in his alias. Within five years of his first output with Future,  he amassed well over a dozen Top 20 R&B/hip-hop hits and a similar quantity of gold and platinum RIAA certifications. Since his early half-decade roll of success working with the likes of Future, iLoveMakkonen, Drake, Migos, and Post Malone -- with \"Honest,\" \"Tuesday,\" \"Jumpman,\" \"Bad and Boujee,\" and \"Congratulations\" among his biggest hits -- Metro has remained a marquee name. He crowned the Billboard 200 with Not All Heroes Wear Capes (2018), his first solo album, and made return trips to the top spot with Savage Mode II (a 2020 duo LP with 21 Savage) and his Grammy-nominated sophomore set, Heroes & Villains (2022). He branched out to film in 2023, helming the soundtrack to Spider-Man: Across the Spider-Verse. WE DON'T TRUST YOU and WE STILL DON'T TRUST YOU, his first two full albums co-billed with Future, topped the charts in 2024.\n\nMetro Boomin got into production during his early teens and also rapped, though he eventually opted to devote all his energy to beatmaking. He connected with artists through social media, and prior to graduating high school, he'd logged thousands of miles on round trips to Atlanta, where he worked with the likes of OJ da Juiceman and, eventually, Gucci Mane and Future. Metro fulfilled his mother's dream with his acceptance to the conveniently located Morehouse College, but he dropped out and invested more in making music than in studying business management.\n\nIn 2013, Metro's name was on Billboard charts for the first time as the producer of Future's \"Karate Chop\" and \"Honest.\" Just after the latter single was officially released, he self-released 19 & Boomin. Once iLoveMakkonen's \"Tuesday,\" another early triumph, hit the R&B/hip-hop Top Ten the following year, Metro was a constant presence near the top of that chart. Drake and Future's \"Jumpman\" and Future's \"Low Life\" were among the early 2016 hits, followed later in the year by \"X\" -- taken from Savage Mode, his self-released EP made with 21 Savage -- and Migos' \"Bad and Boujee,\" which eventually topped the R&B/hip-hop and pop charts.\n\nAmong Metro Boomin's subsequent hits throughout a notable 2017 were Big Sean's \"Bounce Back,\" Post Malone's \"Congratulations,\" Kodak Black's \"Tunnel Vision,\" and Future's \"Mask Off.\" The year remained a busy one, as Metro later released a trio of collaborative mixtapes: Perfect Timing (with NAV), Without Warning (with Offset and 21 Savage), and Double or Nothing (Big Sean). The following year brought even more success for Metro, not only for his input on notable albums by Nicki Minaj and Lil Wayne but also for his own project, Not All Heroes Wear Capes. The album topped the Billboard 200 upon release in November 2018 and yielded a pair of platinum singles with \"No Complaints,\" featuring Offset and Drake, and \"Space Cadet,\" on which Metro was joined by Gunna.\n\nIn 2020, Metro Boomin resumed his partnership with 21 Savage and delivered another Billboard 200 topper, Savage Mode II. Four of its tracks, including \"Glock in My Lap,\" hit the Top 40. Metro scored a third Billboard 200 album in 2022 with his sophomore album, Heroes & Villains. The set contained another quartet of Top 40 entries, most notably the chart-topping platinum hit \"Creepin',\" a collaboration with the Weeknd and 21 Savage that interpolated Mario Winans' \"I Don't Wanna Know.\" He kept the train of number ones rolling in 2023 with the soundtrack to Spider-Man: Across the Spider-Verse, which arrived that June alongside the animated blockbuster. In addition to featuring the likes of Lil Wayne, Offset, Future, James Blake, and many more, the compilation also included the hit single \"Calling\" with Swae Lee, Nav, and A Boogie wit da Hoodie. Heroes & Villains received a nomination for Best Rap Album at the 66th Annual Grammy Awards, while Metro Boomin himself was nominated for Producer of the Year, Non-Classical. After contributing heavily to 21 Savage's chart-topping 2024 album, American Dream, Metro Boomin teamed up with longtime collaborator Future for the full-length WE DON'T TRUST YOU. The album topped the Billboard 200 in its opening week, while the single \"Like That\" was also a number one hit. Three weeks after the album was released, it was followed by WE STILL DON'T TRUST YOU, a distinct album and not a deluxe edition of the first collaboration. Once again, it reached number one. ~ Andy Kellman, Rovi"
    }
  },
  {
    "path": "1RyvyyTE3xzB2ZywiAwp0i",
    "id": 8,
    "name": "Future",
    "verified": true,
    "followed": false,
    "color": "53, 53, 53",
    "artistimage": "/future.jpg",
    "artistbackimage": "/future_back.jpg",
    "monthlylisteners": 59513113,
    "populartracks": [
      "2tudvzsrR56uom6smgOcSf",
      "28drn6tQo95MRvO0jQEo5C",
      "2Hh3ETdQKrmSI3QS0hme7g",
      "637oNhilCI9UlkWkUW4Grt",
      "0vjeOZ3Ft5jvAi9SBFJm1j",
      "6FZjiSBSQoj1geAgXjvqez"
    ],
    "artistpick": {
      "path": "3bSNhnaQQXpC639OQ4pMyP",
      "coverpath": "/westilldonttrustyou.jpg",
      "albumname": "WE STILL DON'T TRUST YOU"
    },
    "discography": {
      "all": [
        "3bSNhnaQQXpC639OQ4pMyP",
        "4iqbFIdGOTzXeDtt9owjQn",
        "0wWL6KM5LuMupJdO4SGiMe"
      ],
      "popular": [
        "4iqbFIdGOTzXeDtt9owjQn",
        "3bSNhnaQQXpC639OQ4pMyP"
      ]
    },
    "about": {
      "rankintheworld": 32,
      "followers": 20423951,
      "mostlistenedplaces": [
        {
          "place": "London, GB",
          "listenersnumber": 952017
        },
        {
          "place": "Los Angeles, US",
          "listenersnumber": 875439
        },
        {
          "place": "Chicago, US",
          "listenersnumber": 843857
        },
        {
          "place": "New York City, US",
          "listenersnumber": 809932
        },
        {
          "place": "Dallas, US",
          "listenersnumber": 772969
        }
      ],
      "socialmediaweb": [
        {
          "Instagram": "https://www.instagram.com/future/",
          "Twitter": "https://www.x.com/1future",
          "Wikipedia": "https://en.wikipedia.org/wiki/Future_(rapper)"
        }
      ],
      "briefinfo": "Chart-topping and influential rapper Future is known for a uniquely fluid and melodic yet mumbling vocal style. He busted out of the South at the dawn of the 2010s with a flurry of mixtapes, high-charting albums, certified platinum singles, and contributions to several other hits as a featured artist, then continued to hover at the top of his game, both commercially and creatively, in the years that followed. After he scored his first hit via a guest spot on YC's \"Racks\" (2011), Future quickly became a key factor in Atlanta's grip on the Billboard charts, often with production support from fellow ATL natives and dwellers such as Metro Boomin, Mike WiLL Made-It, Sonny Digital, and Southside. By the end of 2017, Future had amassed 32 Top Ten R&B/hip-hop hits as a headliner and featured artist. Meanwhile, 11 full-length projects -- including an all-platinum run of DS2 (2015), Evol (2016), and Future (2017) -- debuted within the Top Five of the Billboard 200. Future capped off the 2010s by adding to his Top 20 tally with the Grammy-winning \"King's Dead,\" co-producing a remake of Super Fly, and hitting the top of the Billboard 200 again with The Wizrd (2019). He has since returned to the throne with several projects, including High Off Life (2020), WE DON'T TRUST YOU/WE STILL DON'T TRUST YOU (with Metro Boomin, 2024), and Mixtape Pluto (2024).\n\nBorn Nayvadius Wilburn, Future grew up in his city's Zone 6 section with roots in the ATL's Dungeon Family, who dubbed him \"the Future.\" Mentored by cousin and fellow Dungeon Family member Rico Wade of the revered Organized Noize, Future released his first mixtapes in 2010 and early 2011, which left him poised for a mainstream breakthrough. A few months after the January 2011 release of his third mixtape, Future was featured on YC's \"Racks,\" a single that bubbled up to the Top Ten of Billboard's Hot R&B/Hip-Hop chart. Shortly thereafter, the rapper signed with major label Epic, and \"Tony Montana,\" his proper debut single, subsequently peaked just outside the Top 20. Its parent album, Pluto, landed the following April and debuted at number two on the Billboard 200, supported by the number two R&B/hip-hop hit \"Turn on the Lights,\" which earned Future his first RIAA platinum certification. No new studio albums were released in 2013, but Future's year was productive as a guest artist. He appeared on four Top Ten R&B/hip-hop hits that went either gold or platinum: Lil Wayne's \"Love Me,\" Ace Hood's \"Bugatti,\" Rich Gang's \"Tapout,\" and Rocko's \"U.O.E.N.O.\" He also appeared on a remix of \"Body Party\" by Ciara, who became his fiancée that October.\n\nFuture's second full-length album, Honest, was issued in April 2014. It earned both critical acclaim and popular success and peaked at number two. Two singles from the album, \"Move That Dope\" (featuring Pharrel, Pusha T, and Casino) and \"I Won\" (co-produced by frequent collaborator Metro Boomin and featuring Kanye West), went gold. A few months after the album's release, Future and Ciara's split was made public. Late 2014 and early 2015 brought three mixtapes and another hit single, \"Fuck Up Some Commas.\" They primed Future fans for third album DS2, which debuted at number one in July 2015. Only two months later, What a Time to Be Alive, a mixtape collaboration with Drake, reached the same spot.\n\nIn early 2016, Future released Evol, which arrived unannounced but still debuted at number one on the Billboard 200. Its single \"Low Life,\" a collaboration with the Weeknd, quickly went double platinum. In November of that year, Future issued another Drake-assisted hit, \"Used to This,\" from his Beast Mode 16 mixtape. The roll continued through 2017 with a pair of full-lengths, Future and HNDRXX. Issued during consecutive weeks that February, the two albums kept Future's streak of number ones intact, while the former, featuring the Top Ten pop hit \"Mask Off,\" became the rapper's third consecutive platinum solo full-length. Later that year, he hopped onto Ty Dolla $ign's \"Don't Judge Me\" with Swae Lee before issuing Super Slimey, a joint effort with Young Thug.\n\nFuture followed with a pair of soundtrack contributions in 2018. First, he joined Jay Rock, Kendrick Lamar, and James Blake for a hit single from the Black Panther soundtrack, \"King's Dead,\" and a few months later released \"No Shame\" from Superfly. He not only contributed to the soundtrack but presented it as well, and was among the film's co-producers. Future started 2019 with the release of his seventh album, The Wizrd, which became his fifth solo chart-topper (and sixth overall). The set featured appearances by Young Thug and Gunna, while Travis Scott assisted \"First Off,\" one of its three charting singles. Less than a month after the release of that album, Future won a Grammy for Best Rap Performance for his contribution to \"King's Dead.\" He returned later in 2019 with the darker and more pained Save Me, a seven-track EP that reached number five.\n\nFuture got an early start on the new decade in January 2020 with \"Life Is Good,\" another Drake collaboration. The single became his second Top Ten pop hit as a headliner and reached quadruple-platinum status by the time he issued High Off Life in May. Originally intended to be titled after the preceding hit -- Future opted to go with a less contentious title due to the COVID-19 pandemic -- High Off Life entered the Billboard 200 at number one. Among its follow-up singles were \"Tycoon\" and \"Trillionaire,\" the latter featuring YoungBoy Never Broke Again. Before the year was over, Future teamed up with Lil Uzi Vert for the collaborative album Pluto x Baby Pluto. The record was released in November 2020 and debuted at number two on the Billboard chart.\n\nFuture remained relatively quiet in 2021, but he returned in 2022 for his ninth solo LP, I NEVER LIKED YOU, which once again topped the U.S. charts. WE DON'T TRUST YOU, Future's first album co-billed with longtime producer Metro Boomin, appeared in 2024, and was another chart-topping success. Three weeks after it was released, it was followed by WE STILL DON'T TRUST YOU, a distinct album and not a deluxe edition of the first collaboration. Once again, it reached number one. The feature-free Mixtape Pluto became Future's third chart-topping release of 2024. ~ David Jeffries & Andy Kellman, Rovi"
    }
  },
  {
    "path": "0Y5tJX1MQlPlqiwlOH1tJY",
    "id": 9,
    "name": "Travis Scott",
    "verified": true,
    "followed": false,
    "color": "98, 20, 10",
    "artistimage": "/travisscott.jpg",
    "artistbackimage": "/travisscott_back.jpg",
    "monthlylisteners": 74529022,
    "populartracks": [
      "6s8WSX1MxNThrot8ThI6fG",
      "42VsgItocQwOQC3XWZ8JNA",
      "2gyHr9WqZeMtzJOpWGuGo6",
      "28drn6tQo95MRvO0jQEo5C",
      "5wG3HvLhF6Y5KTGlK0IW3J",
      "4kjI1gwQZRKNDkw1nI475M",
      "4GL9GMX9t7Qkprvf1YighZ"
    ],
    "artistpick": {
      "path": "3bSNhnaQQXpC639OQ4pMyP",
      "coverpath": "/westilldonttrustyou.jpg",
      "albumname": "WE STILL DON'T TRUST YOU"
    },
    "discography": {
      "all": [
        "5HAxzyUfyay8NElNaehsNe",
        "18NOKLkZETa4sWwLMIm0UZ",
        "42WVQWuf1teDysXiOupIZt"
      ],
      "popular": [
        "5HAxzyUfyay8NElNaehsNe",
        "18NOKLkZETa4sWwLMIm0UZ",
        "42WVQWuf1teDysXiOupIZt"
      ]
    },
    "about": {
      "rankintheworld": 14,
      "followers": 36936080,
      "mostlistenedplaces": [
        {
          "place": "Los Angeles, US",
          "listenersnumber": 969075
        },
        {
          "place": "London, GB",
          "listenersnumber": 964429
        },
        {
          "place": "Chicago, US",
          "listenersnumber": 891888
        },
        {
          "place": "Jakarta, ID",
          "listenersnumber": 886731
        },
        {
          "place": "New York City, US",
          "listenersnumber": 860188
        }
      ],
      "socialmediaweb": [],
      "briefinfo": "Houston-born rapper and producer Travis Scott's psychedelic trap style makes him one of the more distinctive talents to have risen to the height of mainstream commercial popularity. His heavily processed, half-sung/half-rapped style set him apart early on, and he grew from affiliations with Kanye West's GOOD Music and T.I.'s Grand Hustle in the early 2010s to chart-dominating popularity before the close of the decade. After his first studio album, 2015's Rodeo, debuted in the number three position, Scott followed with a pair of number one full-lengths, Birds in the Trap Sing McKnight (2016) and Astroworld (2018), all the while assisting on platinum singles headlined by the likes of Rihanna (\"Bitch Better Have My Money\"), SZA (\"Love Galore\"), and Frake (\"Portland\"), and working extensively with Quavo as Huncho Jack. Whether leading or supporting, Scott's presence was unmistakable, and he quickly accumulated Grammys, endorsement deals, and appearances in more than 80 charting songs. By the 2020s, Scott was one of the most successful living artists on the planet. This level of fame played into both extreme success and profound tragedy, with Scott being at the center of controversy surrounding the deaths and injuries of hundreds of fans at his 2021 Astroworld festival before debuting his genre-crossing, Grammy-nominated fourth album, 2023's UTOPIA. He was then featured on a variety of tracks with 21 Savage, Metro Boomin, Asake, and others.\n\nBorn Jacques Webster, Travis Scott grew up in a suburb of Houston and began making music as a teenager. He formed a duo called the Graduates with Chris Holloway, and they released an EP in 2009. The following year, he formed another duo, the Classmates, with OG Chess. Scott produced the pair's two full-lengths, Buddy Rich and Cruis'n USA, but they broke up near the end of 2011. After dropping out of college, Scott moved to Los Angeles and began recording music on his own. He met T.I. and eventually Kanye West. Scott was hired as an in-house producer for GOOD Music, and appeared on the label's Cruel Summer compilation in 2012. Scott's debut, Owl Pharaoh, was originally scheduled to be released as a free mixtape in 2012, but as his profile grew (including a placement in XXL Magazine's Freshman Class of 2013), and sample clearance issues, the album wasn't released until May 2013. Featuring guest appearances by T.I. and 2 Chainz (on the single \"Upper Echelon\") as well as Toro y Moi and Justin Vernon of Bon Iver, Owl Pharaoh eventually garnered a nomination for Best Mixtape at the 2013 BET Hip Hop Awards.\n\nThe buildup to Scott's first proper studio album involved the Days Before Rodeo mixtape, promoted with the singles \"Don't Play\" and \"Mamacita,\" and the March 2015 U.S. Rodeo Tour, headlined by Scott and supported by Young Thug and Metro Boomin. Several of the dates sold out. The same month, Rihanna's Scott-produced hit single \"Bitch Better Have My Money\" was released. \"3500\" and \"Antidote\" were issued ahead of Rodeo, Scott's second full-length, which followed in September on Grand Hustle/Epic and debuted at number three on the Billboard 200. Toward the end of the year, \"Antidote\" peaked at number 16 on the Hot 100 and became Scott's first platinum single.\n\nChatter regarding a follow-up, along with numerous delays, ensued throughout much of 2016. Meanwhile, Scott extended his commercial presence with featured spots on Wiz Khalifa's \"Bake Sale,\" Rihanna's \"Woo,\" and Kanye West's \"FML,\" as well as a collaboration with Young Thug and Quavo, \"Pick Up the Phone,\" a mid-year hit issued as the lead single of Young Thug's JEFFERY. Three months later, after \"Bitch Better Have My Money\" earned platinum certification, Scott's second proper album arrived. Titled Birds in the Trap Sing McKnight after one of Quavo's lines in \"Pick Up the Phone,\" the woozy, mostly midtempo set featured that hit and contributions from the likes of André 3000, Kid Cudi, and Kendrick Lamar. It went straight to the top of the Billboard 200.\n\nLeading up to his third LP, Scott was featured on a slew of tracks, including platinum singles headlined by SZA (\"Love Galore\"), Drake (\"Portland\"), Miguel (\"Sky Walker\"), 2 Chainz (\"4 AM\"), and Trippie Redd (\"Dark Knight Dummo\"). Scott's own \"Butterfly Effect\" arrived during this torrent of hits in May 2017 and promptly went platinum as well. Seven months later, Huncho Jack, Jack Huncho, a collaborative full-length with Quavo, entered the Billboard 200 at number three. The following May, Scott released \"Watch,\" a non-album track featuring Kanye West and Lil Uzi Vert, and within three months released Astroworld, which he considered the true follow-up to Rodeo. Featuring \"Butterfly Effect,\" the album -- named after a demolished Houston amusement park -- debuted at number one and was supported with a second single, \"Sicko Mode.\" Scott closed out 2018 by appearing on multiple tracks of Metro Boomin's Not All Heroes Wear Capes album.\n\nAfter collaborating with Young Thug and J. Cole on 2019's \"The London\" and being featured on Ed Sheeran's \"Antisocial,\" Scott issued his own solo single, \"Highest in the Room.\" JackBoys, a brief compilation showcasing artists from Scott's Cactus Jack Records label, appeared at the end of the year. The release subsequently became the first number one album of the 2020s. Another Young Thug collaboration, \"Franchise,\" also featuring M.I.A., debuted in September 2020 on top of the Billboard 200.\n\nIn January 2021, Spanish DJ HVME released a deep house reworking of Scott and Kendrick Lamar's song \"Goosebumps,\" eventually topping Billboard's Hot Dance/Electronic Songs Chart. Two more tracks appeared that November, with both \"Escape Plan\" and \"Mafia\" arriving concurrently and hitting the Top Ten of Billboard's Hot R&B/Hip-Hop Songs chart.\n\nOn November 5, 2021, there was a fatal crowd crush during Scott's performance at his third annual Astroworld Festival in Houston, Texas. The event resulted in the death of 10 people with over 300 being treated for injuries. The rapper apologized and the rest of the festival was canceled. Scott and others involved in the festival were investigated, though a Texas grand jury ultimately declined to indict them.\n\nIn May 2022, Scott performed at the Billboard Music Awards, his first live appearance since the Astroworld Festival tragedy. He also contributed to four tracks on Metro Boomin's Heroes & Villains album. In July 2023, he released his fourth studio album, UTOPIA. An ambitious, genre-crossing concept album in the vein of Kanye West's Yeezus, it featured a bevy of producers, including Scott, James Blake, WondaGurl, and others. Also featured were many guests, such as Bad Bunny and the Weeknd on the lead single, \"K-pop,\" and Beyoncé and Bon Iver on \"Delresto (Echoes).\" UTOPIA topped both the Billboard 200 and R&B/Hip-Hop Albums charts and earned a Grammy nomination for Best Rap Album. Scott's work throughout much of 2024 largely consisted of features on records by 21 Savage, Future and Metro Boomin, Mustard, and Asake. ~ Paul Simpson & Andy Kellman, Rovi"
    }
  },
  {
    "path": "246dkjvS1zLTtiykXe5h60",
    "id": 10,
    "name": "Post Malone",
    "verified": true,
    "followed": false,
    "color": "53, 53, 53",
    "artistimage": "/postmalone.jpg",
    "artistbackimage": "/postmalone_back.jpg",
    "monthlylisteners": 69613576,
    "populartracks": [
      "0RiRZpuVRbi7oqRdSMwhQY",
      "21jGcNKet2qwijlDFuPiPb",
      "0e7ipj03S05BNilyu5bRzt",
      "7221xIgOnuakPdLqT0F3nP",
      "6fgSKdHloRioPrZ9oJC7FH",
      "7dt6x5M1jzdTEt8oCbisTK"
    ],
    "artistpick": {
      "path": "4g1ZRSobMefqF6nelkgibi",
      "coverpath": "/hollywoodsbleeding.jpg",
      "albumname": "Hollywood's Bleeding"
    },
    "discography": {
      "all": [
        "1woYXxyyxTQJ0E0AhZE6mj",
        "6fgSKdHloRioPrZ9oJC7FH",
        "4g1ZRSobMefqF6nelkgibi",
        "6trNtQUgC8cgbWcqoMYkOR"
      ],
      "popular": [
        "4g1ZRSobMefqF6nelkgibi",
        "6trNtQUgC8cgbWcqoMYkOR",
        "6fgSKdHloRioPrZ9oJC7FH",
        "1woYXxyyxTQJ0E0AhZE6mj"
      ]
    },
    "about": {
      "rankintheworld": 19,
      "followers": 46517384,
      "mostlistenedplaces": [
        {
          "place": "Sydney, AU",
          "listenersnumber": 1162422
        },
        {
          "place": "London, GB",
          "listenersnumber": 934361
        },
        {
          "place": "Melbourne, AU",
          "listenersnumber": 908162
        },
        {
          "place": "Brisbane, AU",
          "listenersnumber": 810982
        },
        {
          "place": "Chicago, US",
          "listenersnumber": 800293
        }
      ],
      "socialmediaweb": [
        {
          "Facebook": "https://www.facebook.com/postmalone/",
          "Instagram": "https://www.instagram.com/postmalone/",
          "Twitter": "https://www.x.com/postmalone/",
          "Wikipedia": "https://en.wikipedia.org/wiki/Post_Malone"
        }
      ],
      "briefinfo": "Diamond-certified American hitmaker Post Malone bridges the gap between the worlds of rap and the pop mainstream. Within five years of his debut, he went from underground genre novelty to certified superstar, amassing a string of Top Ten singles with a hybrid style that combined his unique vocal delivery, pained lyrics, and hip-hop production inspired as much by Tim McGraw as Kanye West. After the release of his 2015 quintuple-platinum single \"White Iverson,\" off his debut, Stoney, he quickly ascended to the top of the pop mainstream in the late 2010s with a succession of multi-platinum hits that included chart-toppers \"Rockstar\" with 21 Savage and \"Psycho\" with Ty Dolla $ign from 2018's Grammy-nominated Beerbongs & Bentleys and one of the highest-certified singles in RIAA history, \"Sunflower\" with Swae Lee, from 2019's pop-leaning Hollywood's Bleeding. After dialing things back with 2022's vulnerable Twelve Carat Toothache, he made a further push into guitar-based pop with 2023's Austin."
    }
  },
  {
    "path": "74KM79TiuVKeVCqs8QtB0B",
    "id": 11,
    "name": "Sabrina Carpenter",
    "verified": true,
    "followed": true,
    "color": "15, 44, 124",
    "artistimage": "/sabrinacarpenter.jpg",
    "artistbackimage": "/sabrinacarpenter_back.jpg",
    "monthlylisteners": 70553883,
    "populartracks": [
      "2HRqTpkrJO5ggZyyK6NPWz",
      "5G2f63n7IPVPPjfNIGih7Q",
      "2tHwzyyOLoWSFqYNjeVMzj",
      "2Zo1PcszsT9WQ0ANntJbID",
      "6jSQ6c7OkA4ExGWM61uYcS",
      "1UHS8Rf6h5Ar3CDWRd3wjF"
    ],
    "artistpick": {
      "path": "3iPSVi54hsacKKl1xIR2eH",
      "coverpath": "/shortnsweet.jpg",
      "albumname": "Short n' Sweet"
    },
    "discography": {
      "all": [
        "3iPSVi54hsacKKl1xIR2eH",
        "2g4aJTa5ejGpp0O0GKzWAQ",
        "3LXVxMUrioKZcoheV2zT3u"
      ],
      "popular": [
        "3iPSVi54hsacKKl1xIR2eH",
        "2g4aJTa5ejGpp0O0GKzWAQ"
      ]
    },
    "about": {
      "rankintheworld": 18,
      "followers": 19276626,
      "mostlistenedplaces": [
        {
          "place": "Jakarta, ID",
          "listenersnumber": 1507873
        },
        {
          "place": "London, GB",
          "listenersnumber": 1035735
        },
        {
          "place": "Sydney, AU",
          "listenersnumber": 918254
        },
        {
          "place": "Quezon City, PH",
          "listenersnumber": 827170
        },
        {
          "place": "Melbourne, AU",
          "listenersnumber": 777583
        }
      ],
      "socialmediaweb": [
        {
          "Facebook": "https://www.facebook.com/sabrinacarpenter/",
          "Instagram": "https://www.instagram.com/sabrinacarpenter/",
          "Twitter": "https://www.x.com/sabrinaannlynn/",
          "Wikipedia": "https://en.wikipedia.org/wiki/Sabrina_Carpenter"
        }
      ],
      "briefinfo": "Sabrina Carpenter has enchanted an audience of millions as a singer, songwriter, actress and style icon. With her music, she has delivered one anthem after another on stage and in the studio, earning multiple gold and platinum certifications, and performing to sold out crowds around the world. On-screen, she has generated mega-fandom through starring roles on television and film. She is signed to Island Records, where she debuted her acclaimed Gold-certified fifth studio album, emails i can’t send, which appeared on many “Best Of 2022” lists including Rolling Stone and Billboard. In April 2024, Sabrina debuted at Coachella and released her single “Espresso,” which swiftly climbed to #1 on the UK and Australian charts, reached the Top 5 in the US, and hit #1 globally on Spotify, amassing over 200M streams in its first month. Following this, her second single, “Please Please Please,” released in June, soared to #1 on Spotify’s Global and US charts, Apple Music, and eventually the Billboard Hot 100, where it debuted at #2 before reaching #1. In August, she released her highly anticipated sixth studio album, Short n’ Sweet, which instantly received critical acclaim from the likes of the New York Times, Rolling Stone, Pitchfork, and Variety. The album debuted at #1 on the Billboard 200, making it the 3rd biggest first week debut in the US in 2024. Short n' Sweet also topped the charts around the world, reaching #1 in UK, Canada, Australia, Spain, and France."
    }
  },
  {
    "path": "1McMsnEElThX1knmY4oliG",
    "id": 12,
    "name": "Olivia Rodrigo",
    "verified": true,
    "followed": false,
    "color": "48, 25, 81",
    "artistimage": "/oliviarodrigo.jpg",
    "artistbackimage": "/oliviarodrigo_back.jpg",
    "monthlylisteners": 47570282,
    "populartracks": [
      "5wANPM4fQCJwkGd4rN57mH",
      "6HU7h9RYOaPRFeh0R3UeAr",
      "5JCoSi02qi3jJeHdZXMmR8",
      "1kuGVB7EU95pJObxwvfwKS",
      "4ZtFanR9U6ndgddUvNcjcG",
      "3IX0yuEVvDbnqUwMBB3ouC"
    ],
    "artistpick": {
      "path": "6s84u2TUpR3wdUv4NgKA2j",
      "coverpath": "/sour.jpg",
      "albumname": "SOUR"
    },
    "discography": {
      "all": [
        "07J7Q3Z7V00LvCxqzVqj9s",
        "1xJHno7SmdVtZAtXbdbDZp",
        "6s84u2TUpR3wdUv4NgKA2j"
      ],
      "popular": [
        "6s84u2TUpR3wdUv4NgKA2j",
        "1xJHno7SmdVtZAtXbdbDZp"
      ]
    },
    "about": {
      "rankintheworld": 58,
      "followers": 43744553,
      "mostlistenedplaces": [
        {
          "place": "Jakarta, ID",
          "listenersnumber": 1602785
        },
        {
          "place": "London, GB",
          "listenersnumber": 623670
        },
        {
          "place": "Sydney, AU",
          "listenersnumber": 554472
        },
        {
          "place": "Quezon City, PH",
          "listenersnumber": 505445
        },
        {
          "place": "Melbourne, AU",
          "listenersnumber": 474984
        }
      ],
      "socialmediaweb": [
        {
          "Facebook": "https://www.facebook.com/oliviarodrigo/",
          "Instagram": "https://www.instagram.com/oliviarodrigo/",
          "Wikipedia": "https://en.wikipedia.org/wiki/Olivia_Rodrigo"
        }
      ],
      "briefinfo": "After shattering records with her chart-topping, 4x Platinum debut album SOUR – the fastest album in history to have all of its songs certified RIAA Platinum or higher – Olivia Rodrigo makes a monumental return with her new album GUTS, revealing newly heightened sophistication as a vocalist and lyricist. Produced by and co-written with Daniel Nigro (her main creative partner on SOUR), each song intensifies the emotional honesty that’s always imbued her storytelling. Rodrigo expands her expressive palette, uncovering entirely new dimensions of her artistry, as exemplified by lead single “vampire.”\n\nHailed by Pitchfork as the “Best New Track” upon release, “vampire” debuted at No. 1 on the Billboard Hot 100 – as did SOUR hits “drivers license” and “good 4 u,” making Rodrigo the first artist ever to debut the lead singles from two career-opening albums atop the prestigious chart. The 20-year-old is the youngest artist in Hot 100 history to debut three hits at No. 1.\n\nNamed the #1 Album of 2021 by Rolling Stone and hailed as one of the Best Albums of 2021 by The New York Times, among others, SOUR is now triple Platinum in the U.S. and has sold over 16.8 million global album adjusted units with over 66 billion streams worldwide. She received seven GRAMMY® Award nominations—including nods in each of the Big Four categories—and took home awards for Best New Artist, Best Pop Vocal Album and Best Pop Solo Performance at the 64th GRAMMY® Awards."
    }
  },
  {
    "path": "06HL4z0CvFAxyc27GXpf02",
    "id": 13,
    "name": "Taylor Swift",
    "verified": true,
    "followed": true,
    "color": "60, 52, 39",
    "artistimage": "/taylorswift.jpg",
    "artistbackimage": "/taylorswift_back.jpg",
    "monthlylisteners": 87555501,
    "populartracks": [
      "1BxfuPKGuaTgP7aM0Bbdwr",
      "6dODwocEuGzHAavXqTbwHv",
      "1dGr1c8CrMLDpV6mPbImSI",
      "4R2kfaDFhslZEMJqAFNpdd",
      "2fPvQfGQEZOKtJ9qXeL4x8",
      "3hUxzQpSfdDqwM3ZTFQY0K"
    ],
    "artistpick": {
      "path": "5H7ixXZfsNMGbIE5OBSpcb",
      "coverpath": "/thetorturedpoetsdepartment.jpg",
      "albumname": "THE TORTURED POETS DEPARTMENT: THE ANTHOLOGY"
    },
    "discography": {
      "all": [
        "1agEHpWnELaZHWzcbGDCpu",
        "5H7ixXZfsNMGbIE5OBSpcb",
        "2fenSS68JI1h4Fo296JfGr",
        "1NAmidJlEaVgA3MpcPFYGq"
      ],
      "popular": [
        "5H7ixXZfsNMGbIE5OBSpcb",
        "1NAmidJlEaVgA3MpcPFYGq",
        "2fenSS68JI1h4Fo296JfGr"
      ]
    },
    "about": {
      "rankintheworld": 10,
      "followers": 132492072,
      "mostlistenedplaces": [
        {
          "place": "Jakarta, ID",
          "listenersnumber": 2878119
        },
        {
          "place": "London, GB",
          "listenersnumber": 1245995
        },
        {
          "place": "Quezon City, PH",
          "listenersnumber": 1164534
        },
        {
          "place": "Sydney, AU",
          "listenersnumber": 1117255
        },
        {
          "place": "Melbourne, AU",
          "listenersnumber": 930125
        }
      ],
      "socialmediaweb": [
        {
          "Facebook": "https://www.facebook.com/TaylorSwift/",
          "Instagram": "https://www.instagram.com/taylorswift/",
          "Twitter": "https://www.x.com/taylorswift13",
          "Wikipedia": "https://en.wikipedia.org/wiki/Olivia_Rodrigo"
        }
      ],
      "briefinfo": "All’s fair in love and poetry… New album THE TORTURED POETS DEPARTMENT. Out now 🤍"
    }
  },
  {
    "path": "4gzpq5DPGxSnKTe4SA8HAU",
    "id": 14,
    "name": "Coldplay",
    "verified": true,
    "followed": false,
    "color": "0, 52, 99",
    "artistimage": "/coldplay.jpg",
    "artistbackimage": "/coldplay_back.jpg",
    "monthlylisteners": 92439513,
    "populartracks": [
      "3AJwUDP919kvQ9QcozQPxg",
      "3RiPr603aXAoi4GHyXx0uy",
      "1mea3bSkSGXuIRvnydlB5b",
      "7D0RhFcb3CrfPuTJ0obrod",
      "31L9yLXSj6LpCFupyMV6CR",
      "69uxyAqqPIsUyTO8txoP2M"
    ],
    "artistpick": {
      "path": "6ZG5lRT77aJ3btmArcykra",
      "coverpath": "/parachutes.jpg",
      "albumname": "Parachutes"
    },
    "discography": {
      "all": [
        "6RjTapeTvms8jSeIRGc5Ve",
        "3cfAM8b8KqJRoIzt3zLKqw",
        "1CEODgTmTwLyabvwd7HBty",
        "6ZG5lRT77aJ3btmArcykra"
      ],
      "popular": [
        "6ZG5lRT77aJ3btmArcykra",
        "3cfAM8b8KqJRoIzt3zLKqw",
        "1CEODgTmTwLyabvwd7HBty"
      ]
    },
    "about": {
      "rankintheworld": 7,
      "followers": 56743200,
      "mostlistenedplaces": [
        {
          "place": "Jakarta, ID",
          "listenersnumber": 2268482
        },
        {
          "place": "São Paulo, BR",
          "listenersnumber": 1211987
        },
        {
          "place": "Mexico City, MX",
          "listenersnumber": 1174645
        },
        {
          "place": "London, GB",
          "listenersnumber": 1122853
        },
        {
          "place": "Sydney, AU",
          "listenersnumber": 1031784
        }
      ],
      "socialmediaweb": [
        {
          "Facebook": "https://www.facebook.com/colplay/",
          "Instagram": "https://www.instagram.com/colplay/",
          "Twitter": "https://www.x.com/colplay",
          "Wikipedia": "https://en.wikipedia.org/wiki/Coldplay"
        }
      ],
      "briefinfo": "Coldplay formed in London in late 1997. The band have gone on to become one of the most popular acts in the world, selling more than 100 million albums and releasing a long line of hits such as Yellow, Clocks, Fix You, Paradise, Viva La Vida, A Sky Full Of Stars, Hymn For The Weekend, Something Just Like This and Higher Power.\n\nThe band’s acclaimed Music Of The Spheres World Tour, which began in 2022, is taking them to stadiums around the globe, with more than 9 million tickets already sold.\n\nThe tour is accompanied by a comprehensive set of sustainability initiatives which include a show powered by 100% renewable energy in almost all locations; the world’s first tourable battery system; kinetic dancefloors allowing fans to help power the show; solar panels and wind turbines at every venue; incentives to encourage fans to travel by green transport; and one tree planted for every ticket sold.\n\nThe band recently gave an update on the sustainability initiatives, revealing that their current tour has so far produced 59% less CO2e emissions than their previous stadium tour in 2016/17, and that 7 million trees have already been planted (one for each concert goer).\n\nTheir tenth album, Moon Music, lands on October 4, 2024. Moon Music is Coldplay’s first album since 2021’s Music Of The Spheres, which spawned the US Number One single with BTS, My Universe, and was nominated for Album of the Year at the Grammy Awards. Music Of The Spheres has accumulated over 4 billion streams."
    }
  },
  {
    "path": "6KImCVD70vtIoJWnq6nGn3",
    "id": 15,
    "name": "Harry Styles",
    "verified": true,
    "followed": false,
    "color": "53, 53, 53",
    "artistimage": "/harrystyles.jpg",
    "artistbackimage": "/harrystyles_back.jpg",
    "monthlylisteners": 44222378,
    "populartracks": [
      "4Dvkj6JhhA12EX05fT7y2e",
      "6UelLqGlWMcVH1E5c4H7lY",
      "3jjujdWJ72nww5eGnfs2E7",
      "1ZMiCix7XSAbfAJlEZWMCp",
      "1qEmFfgcLObUfQm0j1W2CK",
      "6uvh0In7u1Xn4HgxOfAn8O"
    ],
    "artistpick": {
      "path": "5r36AJ6VOJtp00oxSkBZ5h",
      "coverpath": "/harryshouse.jpg",
      "albumname": "Harry's House"
    },
    "discography": {
      "all": [
        "5r36AJ6VOJtp00oxSkBZ5h",
        "7xV2TzoaVc0ycW7fwBwAml",
        "7neiWgd56IO7vi2cRUP8Tj"
      ],
      "popular": [
        "5r36AJ6VOJtp00oxSkBZ5h",
        "7xV2TzoaVc0ycW7fwBwAml",
        "7neiWgd56IO7vi2cRUP8Tj"
      ]
    },
    "about": {
      "rankintheworld": 69,
      "followers": 33459283,
      "mostlistenedplaces": [
        {
          "place": "Jakarta, ID",
          "listenersnumber": 839417
        },
        {
          "place": "Mexico City, MX",
          "listenersnumber": 637255
        },
        {
          "place": "São Paulo, BR",
          "listenersnumber": 581070
        },
        {
          "place": "Santiago, CL",
          "listenersnumber": 536942
        },
        {
          "place": "Sydney, AU",
          "listenersnumber": 512025
        }
      ],
      "socialmediaweb": [],
      "briefinfo": "Harry Styles’ third solo album, Harry's House, is breaking new ground for one of the most creative forces in pop music, a star who keeps refusing to stand still. It’s a deeply personal statement from an artist who has never sounded this joyous, this confident, this fearless in facing the future. Harry’s House debuted at Number One on the Billboard Charts and moved 521,00 equivalent album units in its first week. Harry's House is currently the best-selling album of 2022. “As It Was,” the critically acclaimed lead single, dropped on April 1st and became an instant record-breaking hit, debuting at Number One in both the U.S. and the U.K. “As It Was” became the most-streamed song in the U.S. in a single day in Spotify history and the most-streamed song globally in a single day of 2022. The British singer-songwriter dropped his blockbuster sophomore album Fine Line on Columbia Records in December 2019. It combined critical acclaim with record-setting commercial success, debuting at Number One on the Billboard charts. “Watermelon Sugar” became his first Number One single, winning Styles his first Grammy, for Best Pop Solo Performance and a 2021 BRIT Award for Best British Single. When Rolling Stone released its comprehensive list of the 500 Greatest Albums of All Time, Fine Line was the most recent album honored, taking its place in history. Harry is taking Love on Tour worldwide through 2022, in the aftermath of his historic Coachella set, in support of Harry’s House."
    }
  },
  {
    "path": "1vCWHaC5f2uS3yhpwWbIA6",
    "id": 16,
    "name": "Avicii",
    "verified": true,
    "followed": false,
    "color": "53, 53, 53",
    "artistimage": "/avicii.jpg",
    "artistbackimage": "/avicii_back.jpg",
    "monthlylisteners": 40734784,
    "populartracks": [
      "0nrRP2bk19rLc0orkWPQk2",
      "0ct6r3EGTcMLPtrXHDvVjc",
      "2P4OICZRVAQcYAV2JReRfj",
      "4lhqb6JvbHId48OUJGwymk",
      "5UqCQaDshqbIk3pkhy4Pjg",
      "4eDYMhIin1pSLIG96f1aD0"
    ],
    "artistpick": {
      "path": "2H6i2CrWgXE1HookLu8Au0",
      "coverpath": "/true.jpg",
      "albumname": "True"
    },
    "discography": {
      "all": [
        "7dqftJ3kas6D0VAdmt3k3V",
        "0h2knr6qpiAq0tV5ri5JMF",
        "2H6i2CrWgXE1HookLu8Au0",
        "1OEGfToF7QbjUgyxMAnGXg"
      ],
      "popular": [
        "2H6i2CrWgXE1HookLu8Au0",
        "7dqftJ3kas6D0VAdmt3k3V",
        "0h2knr6qpiAq0tV5ri5JMF",
        "1OEGfToF7QbjUgyxMAnGXg"
      ]
    },
    "about": {
      "rankintheworld": 82,
      "followers": 23408927,
      "mostlistenedplaces": [
        {
          "place": "Sydney, AU",
          "listenersnumber": 537524
        },
        {
          "place": "Mexico City, MX",
          "listenersnumber": 525352
        },
        {
          "place": "São Paulo, BR",
          "listenersnumber": 498663
        },
        {
          "place": "London, GB",
          "listenersnumber": 491072
        },
        {
          "place": "Jakarta, ID",
          "listenersnumber": 487583
        }
      ],
      "socialmediaweb": [
        {
          "Facebook": "https://www.facebook.com/avicii/",
          "Instagram": "https://www.instagram.com/avicii/",
          "Wikipedia": "https://en.wikipedia.org/wiki/Avicii"
        }
      ],
      "briefinfo": "With his melodic songs and inspirational lyrics Swedish house producer Avicii was one of the defining artists of modern pop. The genre-bending tracks captivated audiences worldwide and are widely considered the soundtrack of a generation. Born 1989 in Stockholm, Tim Bergling grew up being obsessed with video games, a passion that in his teens translated into him making music. After being discovered through a blog and gaining some traction with ”Seek Bromance”, his career exploded in 2011 with ”Levels”. His way of boldly blending musical styles became a trademark of Avicii, shown on full display on his first album ”True”. The leading single ”Wake Me Up”, a fusion of house music and traditional bluegrass, reached the number one spot on the iTunes charts in over 60 countries. The song became the most streamed ever on Spotify to that date, played over 200 million times, and turned Avicii into a sought-after pop producer, collaborating with stars such as Madonna and Coldplay. After touring the world at a frantic pace, all the while struggling with health issues and substance abuse, in 2015 Tim Bergling retired from performing live altogether.   The slower lifestyle allowed him to focus purely on composing, drawing inspiration this time mainly from African and Asian traditions. Bergling was working on his fourth project, ”Tim”, when he tragically passed away during a holiday trip to Oman, in April of 2018. He is regarded as one of the most influential house producers of all time."
    }
  },
  {
    "path": "7CajNmpbOovFoOoasH2HaY",
    "id": 17,
    "name": "Calvin Harris",
    "verified": true,
    "followed": false,
    "color": "93, 30, 0",
    "artistimage": "/calvinharris.jpg",
    "artistbackimage": "/calvinharris_back.jpg",
    "monthlylisteners": 62139117,
    "populartracks": [
      "76dIZzTdrNO15mGBrU3MHi",
      "7MmG8p0F9N3C4AXdK6o6Eb",
      "2vlDrKpOC0eSTqTDRcbYyw",
      "6YUTL4dYpB9xZO5qExPf05",
      "58AGoOGbwsQMhBbH0eFLRR",
      "4slBllHFZYlpg3IjeX5CBl"
    ],
    "artistpick": {
      "path": "1CfqWSAyfmYzHU9ktHxUqd",
      "coverpath": "/96months.jpg",
      "albumname": "96 Months"
    },
    "discography": {
      "all": [
        "1CfqWSAyfmYzHU9ktHxUqd",
        "3GPiefSRSOxqTrgKJIB7RL",
        "48zisMeiXniWLzOQghbPqS"
      ],
      "popular": [
        "1CfqWSAyfmYzHU9ktHxUqd",
        "3GPiefSRSOxqTrgKJIB7RL",
        "48zisMeiXniWLzOQghbPqS"
      ]
    },
    "about": {
      "rankintheworld": 25,
      "followers": 23065291,
      "mostlistenedplaces": [
        {
          "place": "London, GB",
          "listenersnumber": 901644
        },
        {
          "place": "Sydney, AU",
          "listenersnumber": 878731
        },
        {
          "place": "Mexico City, MX",
          "listenersnumber": 840188
        },
        {
          "place": "São Paulo, BR",
          "listenersnumber": 819631
        },
        {
          "place": "Santiago, CL",
          "listenersnumber": 729442
        }
      ],
      "socialmediaweb": [
        
      ],
      "briefinfo": "Producer, DJ and songwriter Calvin Harris stands as the figurehead for modern dance music, having broken world records and dominated the charts. He has over 35 billion combined audio and video streams in his career history, making him one of the most viewed artists on YouTube and one of Sony Music's biggest streaming artists. Calvin has collaborated with global artists including Frank Ocean, Pharrell Williams, Rihanna, The Weeknd, and Travis Scott to name a few. His work has garnered a number of top music awards and nominations, including 14x MTV VMA nominations and 2x wins, 5x Grammy nominations and a 2013 Grammy Award win in the Best Music Video category for “We Found Love”."
    }
  },
  {
    "path": "4tZwfgrHOc3mvqYlEYSvVi",
    "id": 18,
    "name": "Daft Punk",
    "verified": true,
    "followed": false,
    "color": "53, 53, 53",
    "artistimage": "/daftpunk.jpg",
    "artistbackimage": "/daftpunk_back.jpg",
    "monthlylisteners": 22232450,
    "populartracks": [
      "0DiWol3AO6WpXZgp0goxAV",
      "7MXVkk9YMctZqd1Srtv4MB",
      "5W3cjX2J3tjhG8zb6u0qHn",
      "69kOkLUCkxIZYexIgSG8rq",
      "3dhjNA0jGA8vHBQ1VdD6vV",
      "2cGxRwrMyEAp8dEbuZaVv6"
    ],
    "artistpick": {
      "path": "2noRn2Aes5aoNVsU6iWThc",
      "coverpath": "/discovery.jpg",
      "albumname": "Discovery"
    },
    "discography": {
      "all": [
        "4m2880jivSbbyEGAKfITCa",
        "2noRn2Aes5aoNVsU6iWThc",
        "0bHuuhpKn42ktYbyTIeumE"
      ],
      "popular": [
        "2noRn2Aes5aoNVsU6iWThc",
        "4m2880jivSbbyEGAKfITCa",
        "0bHuuhpKn42ktYbyTIeumE"
      ]
    },
    "about": {
      "rankintheworld": 299,
      "followers": 10473934,
      "mostlistenedplaces": [
        {
          "place": "Mexico City, MX",
          "listenersnumber": 512128
        },
        {
          "place": "Santiago, CL",
          "listenersnumber": 367890
        },
        {
          "place": "Paris, FR",
          "listenersnumber": 272743
        },
        {
          "place": "Sydney, AU",
          "listenersnumber": 255454
        },
        {
          "place": "Bogotá, CO",
          "listenersnumber": 248658
        }
      ],
      "socialmediaweb": [
        
      ],
      "briefinfo": "As they evolved from '90s French house pioneers to 2000s dance tastemakers to mainstream heroes in the 2010s, Daft Punk remained one of dance music's most iconic acts. With their early singles and 1997's instant-classic debut album Homework, Guy-Manuel de Homem-Christo and Thomas Bangalter quickly won acclaim for their skill at blending their beloved Chicago house and Detroit techno with pop, funk, indie rock, and hip-hop into nostalgic yet futuristic forms. Not content to just widen electronic music's popularity, on 2001's Discovery they reinvented the then-unfashionable sounds of mid-'80s soft rock and R&B into stylish tracks that also had a childlike wonder. Despite their sizable popularity, Daft Punk were never afraid to challenge their listeners, which they did with 2005's cold and dystopic Human After All. Even when they polarized their audience, there was never any doubt that they staged groundbreaking concerts, and the tour captured on Alive 2007 helped pave the way for arena-sized EDM, particularly in the U.S. With 2013's Random Access Memories, the duo once again looked to the past to create the future, borrowing from prog, disco, and a laid-back West Coast vibe that bucked the predominant trends in electronic music but still resonated with a wide audience. Daft Punk's influence reached further into the mainstream through collaborations with Kanye West and the Weeknd, and the duo's music was sampled by artists ranging from Missy Elliott to the Fall. Though they reinvented themselves continually, wherever Daft Punk went, the rest of pop music followed.\n\nAfter meeting in 1987 as students at Paris' Lycée Carnot secondary school, Bangalter and de Homem-Christo became friends and soon started making music together. In 1992, they formed the band Darlin'. Named after a Beach Boys song, the group featured Bangalter on bass, de Homem-Christo on guitar, and additional guitarist Laurent Brancowitz. Darlin's career was brief: The trio recorded a cover of their namesake song that appeared, along with an original song, on a various artists EP released by Stereolab's label Duophonic (the band also invited Darlin' to play some U.K. shows with them). Following a Melody Maker review that described Darlin's music as \"a daft punky thrash,\" the band broke up. Bangalter and de Homem-Christo began experimenting with electronic music, taking their new project's name from that review and drawing inspiration from pioneers such as Todd Edwards, Juan Atkins, Kraftwerk, Frankie Knuckless, and many more.\n\nBy September 1993, Daft Punk had readied a demo tape, which they gave to Soma co-founder Stuart MacMillan at a rave at EuroDisney. The label released the duo's debut single, \"The New Wave,\" in April 1994. Instantly hailed by the dance music press as the work of a new breed of house innovators, it was followed by May 1995's \"Da Funk,\" the band's first true hit (the record sold 30,000 copies worldwide and saw thorough rinsings by everyone from Kris Needs to the Chemical Brothers). In 1996, the buzz around Daft Punk led them to sign with Virgin, and the label released the single \"Da Funk\"/\"Musique\" that year. Recorded and mixed at the duo's Paris studio Daft House, January 1997's debut album Homework -- named for Daft Punk's D.I.Y. aesthetic -- was a critical and commercial success. The album reached number three in France and stayed on the chart for over a year, while the singles \"Da Funk,\" \"Around the World,\" \"Burnin',\" and \"Revolution 909\" charted in France, the U.K., the U.S., and Australia. The duo supported the record with the Daftendirekt tour, while the Homework video collection D.A.F.T.: A Story about Dogs, Androids, Firemen and Tomatoes followed in 1999 and featured clips directed by Roman Coppola, Michel Gondry, and Spike Jonze.\n\nTo follow their breakthrough debut album, de Homem-Christo and Bangalter reached back to their childhoods in the '70s and '80s and sought to fuse technology with humanity. Once again recorded at Daft House, March 2001's Discovery incorporated disco and synth pop as well as house, garage, and R&B into a sleek, retro-futuristic sound that matched the robotic helmets and gloves the duo introduced with the release of the album. Featuring contributions from heroes such as Romanthony, Edwards, and DJ Sneak, Discovery was an even bigger hit than its predecessor. The album peaked at number two in France and the U.K., while the singles \"One More Time,\" \"Digital Love,\" \"Harder, Faster, Better, Stronger,\" and \"Face to Face\" also charted in the U.K. and the U.S. That November saw the release of Alive 1997, an edit of the duo's Birmingham, England stop on the Daftendirekt tour. Daft Punk capped the Discovery era in 2003 with Interstella 5555: The 5tory of the 5ecret 5tar 5ystem, an animated film they produced with anime and manga creator Leiji Matsumoto that used the album as its soundtrack.\n\nFor Daft Punk's third album, the duo took a drastically different approach. Created in six weeks -- as opposed to the two years they spent making Discovery -- with a handful of gear that included an eight-track machine, March 2005's Human After All was a deliberately raw, stark set of songs inspired by George Orwell's Nineteen Eighty-Four. Though its cold, repetitive feel drew polarized reactions, the album fared well commercially: Human After All reached number three in France, was a Top Ten hit in the U.K., and hit number one on the Billboard Top Dance/Electronic Albums chart in the U.S. The set was also nominated for Best Electronic/Dance Album at the 2006 Grammy Awards. Shortly after its release, Human After All [Remixes] collected reworkings by Soulwax, Digitalism, and Erol Alkan among others.\n\nApril 2006 saw the arrival of Musique, Vol. 1: 1993-2005, a compilation of the duo's best-known songs and remixes accompanied by the videos for Human After All's singles. That May, Daft Punk premiered their film Electroma at the Director's Fortnight at that year's Cannes Film Festival. An experimental sci-fi film about a pair of robots seeking to become human, it began as the video for Human After All's title track before expanding into a feature film (unlike Interstella 5555, the movie did not feature any of Daft Punk's music). Initially earning mixed reviews, over time Electroma won a cult audience. That year, the duo embarked on the Alive tour, which lasted through 2007 and featured some of Daft Punk's most ambitiously staged live sets. Appearing in November 2007, Alive 2007 documented the tour. Early in 2009, the album and its single \"Harder, Better, Faster, Stronger\" won Grammy Awards.\n\nDaft Punk returned with new music in November 2010 in the form of the score to Joseph Kosinski's feature film Tron: Legacy. A collaboration with Joseph Trapanese, who arranged and orchestrated the pair's compositions, it featured an 85-piece orchestra as well as Daft Punk's signature electronics. Bangalter and de Homem-Christo also appeared in the film in a brief cameo. The soundtrack eventually reached number four on the Billboard 200 Albums chart in the U.S. and was nominated for a Best Score Soundtrack Album for Visual Media Grammy Award. Also in 2010, the duo were admitted into the Ordre des Arts et des Lettres, with de Homem-Christo and Bangalter each receiving the rank of Chevalier. The following year saw the April release of the remix album Tron: Legacy Reconfigured, while that September's compilation Soma Records: 20 Years featured the track \"Drive,\" an early recording that was believed to be lost.\n\nFor their fourth album, Daft Punk once again took a different creative tack. Seeking a breezy feel informed by Fleetwood Mac, the Eagles, and Jean Michel Jarre, the duo emphasized live instrumentation and collaborated with artists including Nile Rodgers, Paul Williams, Giorgio Moroder, and Panda Bear. Pharrell Williams appeared on the single \"Get Lucky,\" which preceded the release of the full-length Random Access Memories in May 2013. Recorded in California, New York City, and Paris and spanning disco, prog, and indie influences, the album became one of Daft Punk's biggest successes. It topped the charts in over 20 countries including the U.S., where it became the duo's first number one album and was eventually certified platinum. It also won Grammy Awards for Best Dance/Electronica Album, Album of the Year, and Best Engineered Album, Non-Classical. \"Get Lucky\" hit number one in over 30 countries and earned Grammys for Best Pop Duo/Group Performance and Record of the Year. That year, Daft Punk also co-produced Kanye West's critically acclaimed album Yeezus, and worked on tracks including the single \"Black Skinhead.\" In 2014, the duo appeared on Pharrell's album G I R L and collaborated with Jay-Z on the song \"Computerized.\" A 2015 documentary titled Daft Punk Unchained charted their history from the '90s into the 2010s, featuring interviews with Rodgers, Pharrell, and West, among others. In turn, the duo appeared in that year's Rodgers documentary Nile Rodgers: From Disco to Daft Punk.\n\nDuring the latter half of the 2010s, Daft Punk remained active. They teamed up with the Weeknd's Abel Tesfaye on a pair of songs from his 2016 album Starboy, including the chart-topping title track. The following year, the duo performed with the Weeknd at the 59th Annual Grammy Awards; later in 2017, they co-wrote and produced Parcels' \"Overnight.\" During this time, Daft Punk's members also worked on separate projects. Bangalter co-produced Arcade Fire's 2017 album Everything Now and contributed pieces to the soundtrack to Gaspar Noé's 2018 film Climax, while de Homem-Christo co-wrote and produced tracks for Charlotte Gainsbourg's 2017 album Rest and the Weeknd's 2018 EP My Dear Melancholy,. In 2019, Daft Punk were featured in the Philharmonie de Paris' exhibition Electro, which traced the history of electronic music and its influence on visual arts. In February 2021, the duo disbanded, spreading the news with a YouTube video that featured scenes from the end of Electroma. To commemorate the tenth anniversary of Random Access Memories in 2023, Daft Punk issued a pair of re-releases of the album. In May, a deluxe edition of the album featuring unreleased demos (including \"Infinity Repeating,\" which featured Julian Casablancas & the Voidz), outtakes and the version of \"Touch\" that soundtracked the duo's breakup announcement appeared. The reissue topped the Billboard Dance/Electronic Albums Chart and reached the Top Ten of the Billboard 200 Albums Chart. That November saw the release of a drumless version of the album. ~ Heather Phares & Sean Cooper, Rovi"
    }
  },
  {
    "path": "1uNFoZAHBGtllmzznpCI3s",
    "id": 19,
    "name": "Justin Bieber",
    "verified": true,
    "followed": false,
    "color": "0, 61, 19",
    "artistimage": "/justinbieber.jpg",
    "artistbackimage": "/justinbieber_back.jpg",
    "monthlylisteners": 82224381,
    "populartracks": [
      "50kpGaPAhYJ3sGmk6vplg0",
      "09CtPGIpYB4BrO8qb1RGsF",
      "6I3mqTwhRpn34SLVafSH7G",
      "4B0JvthVoAAuygILe3n4Bs",
      "41L3O37CECZt3N7ziG2z7l",
      "4iJyoBOLtHqaGxP12qzhQI"
    ],
    "artistpick": {
      "path": "5dGWwsZ9iB2Xc3UKR0gif2",
      "coverpath": "/justice.jpg",
      "albumname": "Justice"
    },
    "discography": {
      "all": [
        "5dGWwsZ9iB2Xc3UKR0gif2",
        "1SN6N3fNkZk5oXQ9X46QZ3",
        "6Fr2rQkZ383FcMqFyT7yPr"
      ],
      "popular": [
        "6Fr2rQkZ383FcMqFyT7yPr",
        "5dGWwsZ9iB2Xc3UKR0gif2"
      ]
    },
    "about": {
      "rankintheworld": 12,
      "followers": 80812523,
      "mostlistenedplaces": [
        {
          "place": "Jakarta, ID",
          "listenersnumber": 2582715
        },
        {
          "place": "São Paulo, BR",
          "listenersnumber": 1137226
        },
        {
          "place": "Quezon City, PH",
          "listenersnumber": 943949
        },
        {
          "place": "Sydney, AU",
          "listenersnumber": 908067
        },
        {
          "place": "London, GB",
          "listenersnumber": 821012
        }
      ],
      "socialmediaweb": [
        {
          "Facebook": "https://www.facebook.com/justinbieber/",
          "Instagram": "https://www.instagram.com/justinbieber/",
          "Twitter": "https://www.x.com/justinbieber",
          "Wikipedia": "https://en.wikipedia.org/wiki/Justin_Bieber"
        }
      ],
      "briefinfo": "Justin's recent album JUSTICE includes the chart-topping global smashes \"Peaches feat. Daniel Caesar & Giveon\", “Holy” feat. Chance The Rapper, “Lonely” feat. Benny Blanco, “Anyone,” and “Hold On.\" The album also features guest appearances from The Kid LAROI, Dominic Fike, Khalid, Beam, Burna Boy, Lil Uzi Vert, Jaden, Quavo + more. The JUSTICE campaign has reasserted Justin’s dominance as a live performer; from his triumphant return to the live stage with his T-Mobile-sponsored NYE livestream concert, to his record breaking TikTok performance “Journals Live” to his stunning AR-assisted performance for Spotify, to his epic Nickelodeon Kids' Choice Awards set and this week’s blockbuster NPR Tiny Desk Concert, Justin has delivered undeniable, show stopping performances. Along the way, Justin has appeared as musical guest twice on Saturday Night Live, performed on The American Music Awards, The People’s Choice Awards, and much more.\n\nWith over 86 billion career streams and over 78 million albums sold worldwide, Justin Bieber continues to reign as one of the biggest artists in the world. Bieber is the #1 artist on Spotify with over 75 million monthly listeners!"
    }
  },
  {
    "path": "53XhwfbYqKCa1cC15pYq2q",
    "id": 20,
    "name": "Imagine Dragons",
    "verified": true,
    "followed": false,
    "color": "101, 13, 12",
    "artistimage": "/imaginedragons.jpg",
    "artistbackimage": "/imaginedragons_back.jpg",
    "monthlylisteners": 59435157,
    "populartracks": [
      "0pqnGHJpmpxLKifKRmU6WP",
      "2FY7b99s15jUprqC0M5NCT",
      "1zB4vmk8tFRmM9UULNzbLB",
      "2RSHsoi04658QL5xgQVov3",
      "6Qn5zhYkTa37e91HC1D7lb",
      "6aiHF2IbJr6lG4Vu9em8KF"
    ],
    "artistpick": {
      "path": "33pt9HBdGlAbRGBHQgsZsU",
      "coverpath": "/evolve.jpg",
      "albumname": "Evolve"
    },
    "discography": {
      "all": [
        "3JfSxDfmwS5OeHPwLSkrfr",
        "2wVV49qXJai8kmCb1Czp0p",
        "33pt9HBdGlAbRGBHQgsZsU"
      ],
      "popular": [
        "33pt9HBdGlAbRGBHQgsZsU",
        "3JfSxDfmwS5OeHPwLSkrfr",
        "2wVV49qXJai8kmCb1Czp0p"
      ]
    },
    "about": {
      "rankintheworld": 32,
      "followers": 56441149,
      "mostlistenedplaces": [
        {
          "place": "São Paulo, BR",
          "listenersnumber": 942358
        },
        {
          "place": "Mexico City, MX",
          "listenersnumber": 766094
        },
        {
          "place": "Sydney, AU",
          "listenersnumber": 596963
        },
        {
          "place": "Jakarta, ID",
          "listenersnumber": 587550
        },
        {
          "place": "London, GB",
          "listenersnumber": 571866
        }
      ],
      "socialmediaweb": [
        {
          "Facebook": "https://www.facebook.com/imaginedragons/",
          "Instagram": "https://www.instagram.com/imaginedragons/",
          "Twitter": "https://www.x.com/imaginedragons",
          "Wikipedia": "https://en.wikipedia.org/wiki/Imagine_Dragons"
        }
      ],
      "briefinfo": "Formed in 2009, Imagine Dragons first revealed their emotionally charged and inventive sensibilities with a series of independently released EPs that earned them grassroots following. Signed to KIDinaKORNER/Interscope by hitmaking producer Alex Da Kid, the band greatly expanded their fanbase with the release of their multi-platinum breakthrough single “It’s Time” (featured on the 2012 EP Continued Silence). With their past hits also including “Radioactive” (a diamond-selling smash that won Best Rock Performance at the 2014 Grammy Awards), Imagine Dragons went on to see Smoke + Mirrors debut at #1 on the Billboard Top 200 album chart upon its release in early 2015.\n\nFor Imagine Dragons, one of the greatest achievements of Evolve is its unfettered honesty. “Instead of hiding behind metaphors, I was able to be more direct in my lyrics,” says Reynolds. “I really focused on searching deeper for lyrical value.” Along with giving the album untold emotional depth, honesty cuts through everyday chaos to reveal a luminous truth. “Right now the world can seem like a very dark and daunting place,” says Reynolds. “We wanted to create something like a lot of the records we grew up on, where it feels like you’re escaping into a world that’s much more vibrant. Our hope is that the album helps people focus on the beauty of each moment, and really see all the brilliance and color of life.”"
    }
  },
  {
    "path": "6VuMaDnrHyPL1p4EHjYLi7",
    "id": 21,
    "name": "Charlie Puth",
    "verified": true,
    "followed": false,
    "color": "53, 53, 53",
    "artistimage": "/charlieputh.jpg",
    "artistbackimage": "/charlieputh_back.jpg",
    "monthlylisteners": 38574768,
    "populartracks": [
      "54PbBpquVfhfrwRwvjSXbI",
      "5cF0dROlMOK5uNZtivgu50",
      "5MwIGPDKeDb7SpblcaQP6O",
      "6wmAHw1szh5RCKSRjiXhPe",
      "1q4BCQssFe74UJmnWt5lov",
      "2EbseeW2cr5zK3J8VuYntw"
    ],
    "artistpick": {
      "path": "0mZIUXje90JtHxPNzWsJNR",
      "coverpath": "/voicenotes.jpg",
      "albumname": "Voicenotes"
    },
    "discography": {
      "all": [
        "0xNBKoAOgkjxgDsmoa5lpV",
        "0mZIUXje90JtHxPNzWsJNR",
        "5J4SS8wTmXdyIEVYjmHzpZ"
      ],
      "popular": [
        "0mZIUXje90JtHxPNzWsJNR",
        "5J4SS8wTmXdyIEVYjmHzpZ",
        "0xNBKoAOgkjxgDsmoa5lpV"
      ]
    },
    "about": {
      "rankintheworld": 88,
      "followers": 24099715,
      "mostlistenedplaces": [
        {
          "place": "Jakarta, ID",
          "listenersnumber": 1452301
        },
        {
          "place": "Bangkok, TH",
          "listenersnumber": 456386
        },
        {
          "place": "Kuala Lumpur, MY",
          "listenersnumber": 424472
        },
        {
          "place": "Quezon City, PH",
          "listenersnumber": 416351
        },
        {
          "place": "Bengaluru, IN",
          "listenersnumber": 375010
        }
      ],
      "socialmediaweb": [
        {
          "Facebook": "https://www.facebook.com/charlieputh/",
          "Instagram": "https://www.instagram.com/charlieputh/",
          "Twitter": "https://www.x.com/charlieputh",
          "Wikipedia": "https://en.wikipedia.org/wiki/Charlie_Puth"
        }
      ],
      "briefinfo": "Charlie Puth has proven to be one of the industry’s most consistent hitmakers and sought-after collaborators. Puth has amassed eight multi-platinum singles, four GRAMMY nominations, three Billboard Music Awards, a Critic’s Choice Award, and a Golden Globe nomination. His 2018 GRAMMY-nominated LP, Voicenotes, was RIAA Certified Gold only four days after its release and has logged over 6.7 billion streams worldwide. Recently, Puth released his highly anticipated third studio album CHARLIE via Atlantic Records. Featuring hit singles “Left and Right [feat. Jung Kook of BTS], “That’s Hilarious” and “Light Switch,” the “expertly crafted collection” (ROLLING STONE) has surpassed 2 billion global streams. Following the release of his CHARLIE, Puth set out for his ‘One Night Only’ tour, welcoming fans around the world up close and personal as he shares his latest album and his greatest hits. In 2020, Puth’s collaboration with Gabby Barrett on their “I Hope” Remix earned him his fourth top 10 track on the Billboard Hot 100, hit number one on the Billboard “Adult Pop Songs” chart, and won a 2021 Billboard Music Award for “Top Collaboration.” Puth also co-wrote and produced The Kid Laroi and Justin Bieber’s record-breaking single, “Stay,” which quickly become one of the biggest songs of 2021 and holds the title for the longest-reigning No. 1 on the Billboard Global 200 chart and the first to lead it for double-digits - spending a total of eleven weeks at the top of the chart."
    }
  },
  {
    "path": "6eUKZXaKkcviH0Ku9w2n3V",
    "id": 22,
    "name": "Ed Sheeran",
    "verified": true,
    "followed": false,
    "color": "72, 16, 17",
    "artistimage": "/edsheeran.jpg",
    "artistbackimage": "/edsheeran_back.jpg",
    "monthlylisteners": 72725900,
    "populartracks": [
      "7qiZfU4dY1lWllzX7mPBI3",
      "0tgVpDi06FyKpA1z0VMD4v",
      "50nfwKoDiSYg8zOCREWAm5",
      "3HVWdVOQ0ZA45FuZGSfvns",
      "3rmo8F54jFF8OgYsqTxm5d",
      "6PCUP3dWmTjcTtXY02oFdT"
    ],
    "artistpick": {
      "path": "3T4tUhGYeRNVUGevb0wThu",
      "coverpath": "/divide.jpg",
      "albumname": "÷ (Deluxe)"
    },
    "discography": {
      "all": [
        "32iAEBstCjauDhyKpGjTuq",
        "5Nux7ozBJ5KJ02QYWwrneR",
        "3T4tUhGYeRNVUGevb0wThu"
      ],
      "popular": [
        "3T4tUhGYeRNVUGevb0wThu",
        "32iAEBstCjauDhyKpGjTuq",
        "5Nux7ozBJ5KJ02QYWwrneR"
      ]
    },
    "about": {
      "rankintheworld": 17,
      "followers": 119113661,
      "mostlistenedplaces": [
        {
          "place": "Jakarta, ID",
          "listenersnumber": 119113661
        },
        {
          "place": "Sydney, AU",
          "listenersnumber": 927026
        },
        {
          "place": "London, GB",
          "listenersnumber": 918655
        },
        {
          "place": "São Paulo, BR",
          "listenersnumber": 809380
        },
        {
          "place": "Melbourne, AU",
          "listenersnumber": 742591
        }
      ],
      "socialmediaweb": [
        {
          "Facebook": "https://www.facebook.com/edsheeranmusic/",
          "Instagram": "https://www.instagram.com/teddysphotos/",
          "Twitter": "https://www.x.com/edsheeran",
          "Wikipedia": "https://en.wikipedia.org/wiki/Ed_Sheeran"
        }
      ],
      "briefinfo": "Idiosyncratic pop singer Ed Sheeran borrows from any style that crosses his path, molding genres to fit a musical character all his own that's charming, personable, and popular on a global scale. Elements of folk, hip-hop, pop, dance, soul, and rock can be heard in his big hits \"The A Team,\" \"Sing,\" \"Thinking Out Loud,\" and \"Shape of You\" -- which gives him a broad appeal among different demographics. It also helped elevate him to international acclaim not long after the release of his 2011 debut LP, +, and took 2014's x and 2017's ÷ to the top of both the U.K. albums chart and the Billboard 200. Sheeran maintained his stardom with savvy collaborations -- his 2019 album No. 6 Collaborations Project featured an eclectic roster including Khalid, Camila Cabello, Cardi B, Justin Bieber, Chris Stapleton, and Bruno Mars -- and by continuing to write candidly about his life: his 2021 album = was filled with songs about being a new father. Sheeran's musical explorations continued on -, a 2023 album that featured several tracks co-written and co-produced by Aaron Dessner of the National, and its swiftly released companion, Autumn Variations, both of which reached the Top Five in the U.K. and on the Billboard 200.\n\nWhen Ed Sheeran released +, he had just turned 20. He had been playing music since he was a child in Framlingham, Suffolk -- he was born in Halifax, West Yorkshire but his family moved when he was young -- enthralled by the classic rock he heard around the house. Sheeran started writing music in his early teens, recording a self-made album called Spinning Man when he was 13 in 2004. In addition to making music at home -- he put out an EP titled The Orange Room in 2005 -- he'd busk on the streets and play whatever stage he could find. When he was 16, he dropped out of school and moved to London so he could make a go of a professional career, landing work as a guitar tech for Nizlopi, gigging whenever he could, and auditioning unsuccessfully for the ITV series Britannia High. The self-released EP You Need Me arrived in 2009 -- it followed 2006's eponymous EP and 2007's Want Some? -- but his momentum started to build in 2010 thanks to the EPs Loose Change and Songs I Wrote with Amy and, especially, performance videos he posted to YouTube. Sheeran started to generate considerable buzz -- Jamie Foxx invited him to appear on his Sirius/XM radio show -- and he landed a deal with Asylum Records in late 2010. After a final independent EP, No. 5 Collaborations, arrived in January 2011, he signed a contract with Elton John's management team.\n\nAll of this laid the groundwork for a busy 2011. Sheeran entered the studio with Jake Gosling to record his major-label debut. Its first single, \"The A Team,\" arrived in June 2011, entering the charts at number three. August brought \"You Need Me, I Don't Need You,\" setting the stage for the September release of +. Assisted by the success of November's single \"Lego House,\" the record became a huge hit in the U.K., a fact underscored by his win of British Breakthrough in the 2012 Brit Awards. Sheeran's success soon spread to Australia, Europe, Canada, and then the United States. He received a boost in the U.S. by opening for Snow Patrol in 2012, but that paled in comparison to the exposure he received opening for Taylor Swift on her Red tour in 2013. His endorsement from Swift, combined with his landing of the closing credits song \"I See Fire\" for The Hobbit: The Desolation of Smaug, set Sheeran up for an eventful 2014.\n\nAlong with reuniting with Jake Gosling, Sheeran worked with Rick Rubin and Pharrell for X, the sophomore set that arrived in June 2014. X debuted at number one on both sides of the Atlantic and generated the huge hits \"Thinking Out Loud\" and \"Sing,\" success that helped Sheeran secure a win for Album of the Year in the 2015 Brit Awards, along with the trophy for Best Male Solo Artist. His success wasn't limited to Britain. X was the second biggest-selling album in the world in 2015, coming in behind Adele's 25, and \"Thinking Out Loud\" took home the Grammys for Song of the Year and Best Pop Solo Performance in 2016.\n\nSheeran spent the majority of 2016 recuperating and recording his third album with executive producer Benny Blanco. Early in 2017, he released two singles, \"Castle on the Hill\" and \"Shape of You,\" with the latter reaching number one on the charts throughout the world. Their parent album, ÷, appeared in March. ÷ topped the pop charts in over 20 territories, including the U.K. and U.S., and it generated another international hit in \"Galway Girl.\" Ed Sheeran's massive popularity was confirmed in June 2017, when he was awarded an MBE on the occasion of the Queen's Birthday Honours. Over the next year, Sheeran stayed busy touring. He also picked up several more accolades including winning the Grammy Award for Best Pop Vocal Album for ÷ and Best Pop Solo Performance for \"Shape of You.\"\n\nIn 2019, he paired with Justin Bieber for the single \"I Don't Care.\" It was the first of a series of duets which Sheeran collected on No. 6 Collaborations Project. The album appeared on July 12, 2019 and topped numerous charts just a few weeks after the release of Yesterday, a Danny Boyle film set in an alternate world where the Beatles never existed that featured Sheeran in a pivotal role. No. 6 Collaborations Project went on to be nominated for a Grammy in the Best Pop Vocal Album category. In December 2020, Sheeran offered up the acoustic non-album single, \"Afterglow\" as a Christmas gift to his fans.\n\nSheeran returned with \"Bad Habits\" in June 2021; the single topped the charts in nearly every country, save the U.S., where it peaked at two. The track was the first single from his fifth album, =. Arriving in October 2021, the record found Sheeran grappling with fatherhood and featured songwriting collaborations from Foy Vance, Ben Kweller, and Natalie Hemby, among others. It continued Sheeran's streak of number one albums in the U.K. and was equally successful internationally. That December, he joined ELton John for the holiday song \"Merry Christmas,\" which topped the U.K. singles chart and Billboard's Adult Contemporary chart. The single was also included on a Christmas edition of =, as well as John's The Lockdown Sessions. Sheeran then collaborated with Colombian singer J Balvin on 2021's \"Sigue\" and 2022's \"Forever My Love.\" Also in 2022, he scored a Top Ten U.K. hit with the Pokémon-related \"Celestial\" before kicking off 2023 with \"F64,\" a heartfelt tribute to the late British music entrepreneur Jamal Edwards.\n\nSheeran launched the cycle for his fifth album in early 2023 with the release of the singles \"Eyes Closed\" and \"Boat.\" Both songs were included on -, a record that featured several collaborations with Aaron Dessner of the National, along with work by Max Martin, Shellback, and Foy Vance. Four months afterward - debuted at number one in the U.K. and number two in the U.S. Sheeran released Autumn Variations, an album recorded with Dessner as producer. The latter album also topped the charts in the U.K. and reached the Top Ten of the Billboard 200. By the end of the year, - had earned a Best Pop Vocal Album nomination at the 66th Grammy Awards. The singer's first-ever greatest-hits album, +-=÷× TOUR COLLECTION, arrived in September 2024 and combined live recordings with some of his most beloved studio hits. ~ Stephen Thomas Erlewine, Rovi"
    }
  }
]